{
    "brand": {
        "ar-AE": "فيرستبوت",
        "ar-SA": "فيرستبوت",
        "bg-BG": "Firstbot",
        "cs-CZ": "Firstbot",
        "da-DK": "Firstbot",
        "de-DE": "Firstbot",
        "el-GR": "Firstbot",
        "en-CA": "Firstbot",
        "en-US": "Firstbot",
        "en-GB": "Firstbot",
        "es-ES": "Firstbot",
        "es-MX": "Firstbot",
        "fi-FI": "Firstbot",
        "fil-PH": "Firstbot",
        "fr-CA": "Firstbot",
        "fr-FR": "Firstbot",
        "hi-IN": "फर्स्टबॉट",
        "hr-HR": "Firstbot",
        "id-ID": "Firstbot",
        "it-IT": "Firstbot",
        "ja-JP": "ファーストボット",
        "ko-KR": "퍼스트봇",
        "ms-MY": "Firstbot",
        "nl-NL": "Firstbot",
        "pl-PL": "Firstbot",
        "pt-BR": "Firstbot",
        "pt-PT": "Firstbot",
        "ro-RO": "Firstbot",
        "sk-SK": "Firstbot",
        "sv-SE": "Firstbot",
        "ta-IN": "பர்ஸ்ட்பாட்",
        "tr-TR": "Firstbot",
        "uk-UA": "Firstbot",
        "zh-CN": "Firstbot 第一智能",
        "zh-HK": "Firstbot 第一智能",
        "zh-TW": "Firstbot 第一智能"
    },
    "language": {
        "en-US": "English (US)",
        "en-AU": "English (AU)",
        "en-CA": "English (CA)",
        "en-GB": "English (UK)",
        "es-ES": "Español (ES)",
        "es-MX": "Español (MX)",
        "zh-HK": "繁體中文 (香港)",
        "zh-TW": "繁體中文 (台灣)",
        "zh-CN": "简体中文",
        "ja-JP": "日本語",
        "ko-KR": "한국어",
        "ar-AE": "العربية (الإمارات)",
        "ar-SA": "العربية (السعودية)",
        "bg-BG": "български",
        "cs-CZ": "Čeština",
        "da-DK": "Dansk",
        "de-DE": "Deutsch",
        "el-GR": "Ελληνικά",
        "fi-FI": "Suomi",
        "fil-PH": "Filipino",
        "fr-CA": "Français (CA)",
        "fr-FR": "Français (FR)",
        "hi-IN": "हिन्दी",
        "hr-HR": "Hrvatski",
        "id-ID": "Bahasa Indonesia",
        "it-IT": "Italiano",
        "ms-MY": "Bahasa Melayu",
        "nl-NL": "Nederlands",
        "pl-PL": "Polski",
        "pt-BR": "Português (BR)",
        "pt-PT": "Português (PT)",
        "ro-RO": "Română",
        "sk-SK": "Slovenčina",
        "sv-SE": "Svenska",
        "ta-IN": "தமிழ்",
        "tr-TR": "Türkçe",
        "uk-UA": "Українська"
    },
    "apiKey": {
        "en-US": "API Key",
        "en-AU": "API Key",
        "en-CA": "API Key",
        "en-GB": "API Key",
        "es-ES": "Claves de API",
        "es-MX": "Claves de API",
        "zh-HK": "API 密鑰",
        "zh-TW": "API 密鑰",
        "zh-CN": "API 密钥",
        "ja-JP": "API キー",
        "ko-KR": "API 키",
        "ar-AE": "مفاتيح API",
        "ar-SA": "مفاتيح API",
        "bg-BG": "API ключове",
        "cs-CZ": "API klíče",
        "da-DK": "API-nøgler",
        "de-DE": "API-Schlüssel",
        "el-GR": "Κλειδιά API",
        "fi-FI": "API-avaimet",
        "fil-PH": "Mga API key",
        "fr-CA": "Clés API",
        "fr-FR": "Clés API",
        "hi-IN": "एपीआई कुंजी",
        "hr-HR": "API ključevi",
        "id-ID": "Kunci API",
        "it-IT": "Chiavi API",
        "ms-MY": "Kunci API",
        "nl-NL": "API-sleutels",
        "pl-PL": "Klucze API",
        "pt-BR": "Chaves de API",
        "pt-PT": "Chaves de API",
        "ro-RO": "Chei API",
        "sk-SK": "API kľúče",
        "sv-SE": "API-nycklar",
        "ta-IN": "API விசைகள்",
        "tr-TR": "API Anahtarları",
        "uk-UA": "Ключі API"
    },
    "search": {
        "ar-AE": "بحث",
        "ar-SA": "بحث",
        "bg-BG": "Търсене",
        "cs-CZ": "Hledat",
        "da-DK": "Søg",
        "de-DE": "Suchen",
        "el-GR": "Αναζήτηση",
        "en-AU": "Search",
        "en-CA": "Search",
        "en-GB": "Search",
        "en-US": "Search",
        "es-ES": "Buscar",
        "es-MX": "Buscar",
        "fi-FI": "Hae",
        "fil-PH": "Maghanap",
        "fr-CA": "Recherche",
        "fr-FR": "Rechercher",
        "hi-IN": "खोज",
        "hr-HR": "Pretraži",
        "id-ID": "Cari",
        "it-IT": "Cerca",
        "ja-JP": "検索",
        "ko-KR": "검색",
        "ms-MY": "Cari",
        "nl-NL": "Zoeken",
        "pl-PL": "Szukaj",
        "pt-BR": "Pesquisar",
        "pt-PT": "Pesquisa",
        "ro-RO": "Caută",
        "sk-SK": "Hľadať",
        "sv-SE": "Sök",
        "ta-IN": "தேடல்",
        "tr-TR": "Ara",
        "uk-UA": "Пошук",
        "zh-CN": "搜索",
        "zh-HK": "搜索",
        "zh-TW": "搜尋"
    },
    "noResult": {
        "ar-AE": "لم يتم العثور على نتائج",
        "ar-SA": "لم يتم العثور على نتائج",
        "bg-BG": "Не са намерени резултати",
        "cs-CZ": "Nebyly nalezeny žádné výsledky",
        "da-DK": "Ingen resultater fundet",
        "de-DE": "Kein Ergebnis gefunden",
        "el-GR": "Δεν βρέθηκαν αποτελέσματα",
        "en-AU": "No result found",
        "en-CA": "No result found",
        "en-GB": "No result found",
        "en-US": "No result found",
        "es-ES": "No se encontraron resultados",
        "es-MX": "No se encontraron resultados",
        "fi-FI": "Tuloksia ei löytynyt",
        "fil-PH": "Walang nahanap na resulta",
        "fr-CA": "Aucun résultat trouvé",
        "fr-FR": "Aucun résultat trouvé",
        "hi-IN": "कोई परिणाम नहीं मिला",
        "hr-HR": "Nema rezultata",
        "id-ID": "Tidak ada hasil yang ditemukan",
        "it-IT": "Nessun risultato trovato",
        "ja-JP": "結果が見つかりませんでした",
        "ko-KR": "결과를 찾을 수 없습니다",
        "ms-MY": "Tiada keputusan ditemui",
        "nl-NL": "Geen resultaten gevonden",
        "pl-PL": "Nie znaleziono wyników",
        "pt-BR": "Nenhum resultado encontrado",
        "pt-PT": "Nenhum resultado encontrado",
        "ro-RO": "Nu s-a găsit niciun rezultat",
        "sk-SK": "Neboli nájdené žiadne výsledky",
        "sv-SE": "Inga resultat hittades",
        "ta-IN": "முடிவுகள் காணப்படவில்லை",
        "tr-TR": "Sonuç bulunamadı",
        "uk-UA": "Результатів не знайдено",
        "zh-CN": "未找到结果",
        "zh-HK": "未找到結果",
        "zh-TW": "未找到結果"
    },
    "bringYourOwnKey": {
        "en-US": "Bring your own key",
        "en-AU": "Bring your own key",
        "en-CA": "Bring your own key",
        "en-GB": "Bring your own key",
        "es-ES": "Trae tu propia clave",
        "es-MX": "Trae tu propia clave",
        "zh-HK": "自行帶來金鑰",
        "zh-TW": "自行帶來金鑰",
        "zh-CN": "自带密钥",
        "ja-JP": "独自のキーを持参",
        "ko-KR": "자체 키 가져오기",
        "ar-AE": "أحضر مفتاحك الخاص",
        "ar-SA": "أحضر مفتاحك الخاص",
        "bg-BG": "Донесете собствения си ключ",
        "cs-CZ": "Přineste si vlastní klíč",
        "da-DK": "Medbring din egen nøgle",
        "de-DE": "Bringen Sie Ihren eigenen Schlüssel mit",
        "el-GR": "Φέρτε το δικό σας κλειδί",
        "fi-FI": "Ota oma avain mukaan",
        "fil-PH": "Dalhin ang iyong sariling key",
        "fr-CA": "Apportez votre propre clé",
        "fr-FR": "Apportez votre propre clé",
        "hi-IN": "अपनी खुद की कुंजी लेकर आइए",
        "hr-HR": "Ponesite svoj vlastiti ključ",
        "id-ID": "Bawa kunci Anda sendiri",
        "it-IT": "Porta la tua chiave",
        "ms-MY": "Bawa kunci anda sendiri",
        "nl-NL": "Breng je eigen sleutel mee",
        "pl-PL": "Przynieś własny klucz",
        "pt-BR": "Traga sua própria chave",
        "pt-PT": "Traga a sua própria chave",
        "ro-RO": "Aduceți-vă propriul cheie",
        "sk-SK": "Poneste si svoj vlastný kľúč",
        "sv-SE": "Ta med din egen nyckel",
        "ta-IN": "உங்கள் சொந்த விசையை எடுக்கவும்",
        "tr-TR": "Kendi anahtarınızı getirin",
        "uk-UA": "Принесіть свій власний ключ"
    },
    "bringYourOwnKeyDescription": {
        "en-US": "Use your own Anthropic key with Firstbot Carpenter. The key will be stored securely and locally ONLY on your device. You can revoke access at any time. By setting the key, you accept the terms of service and data privacy policy of Kios Tech Int. Ltd. Check the Anthropic documentation to create an API key.",
        "en-AU": "Use your own Anthropic key with Firstbot Carpenter. The key will be stored securely and locally ONLY on your device. You can revoke access at any time. By setting the key, you accept the terms of service and data privacy policy of Kios Tech Int. Ltd. Check the Anthropic documentation to create an API key.",
        "en-CA": "Use your own Anthropic key with Firstbot Carpenter. The key will be stored securely and locally ONLY on your device. You can revoke access at any time. By setting the key, you accept the terms of service and data privacy policy of Kios Tech Int. Ltd. Check the Anthropic documentation to create an API key.",
        "en-GB": "Use your own Anthropic key with Firstbot Carpenter. The key will be stored securely and locally ONLY on your device. You can revoke access at any time. By setting the key, you accept the terms of service and data privacy policy of Kios Tech Int. Ltd. Check the Anthropic documentation to create an API key.",
        "es-ES": "Utiliza tu propia clave de Anthropic con Firstbot Carpenter. La clave se almacenará de forma segura y local ÚNICAMENTE en tu dispositivo. Puedes revocar el acceso en cualquier momento. Al configurar la clave, aceptas los términos del servicio y la política de privacidad de datos de Kios Tech Int. Ltd. Consulta la documentación de Anthropic para crear una clave de API.",
        "es-MX": "Utiliza tu propia clave de Anthropic con Firstbot Carpenter. La clave se almacenará de forma segura y local ÚNICAMENTE en tu dispositivo. Puedes revocar el acceso en cualquier momento. Al configurar la clave, aceptas los términos del servicio y la política de privacidad de datos de Kios Tech Int. Ltd. Consulta la documentación de Anthropic para crear una clave de API.",
        "zh-HK": "使用您自己的 Anthropic 金鑰與 Firstbot Carpenter。 金鑰將僅在您的設備上安全且本地存儲。 您可以隨時撤銷訪問權限。 設置金鑰即表示您接受 Kios Tech Int. Ltd. 的服務條款和數據隱私政策。 檢查 Anthropic 文檔以創建 API 金鑰。",
        "zh-TW": "使用您自己的 Anthropic 金鑰與 Firstbot Carpenter。 金鑰將僅在您的設備上安全且本地存儲。 您可以隨時撤銷訪問權限。 設置金鑰即表示您接受 Kios Tech Int. Ltd. 的服務條款和數據隱私政策。 檢查 Anthropic 文檔以創建 API 金鑰。",
        "zh-CN": "使用您自己的 Anthropic 密钥与 Firstbot Carpenter。 该密钥将仅在您的设备上安全且本地存储。 您可以随时撤销访问权限。 设置密钥即表示您接受 Kios Tech Int. Ltd. 的服务条款和数据隐私政策。 查看 Anthropic 文档以创建 API 密钥。",
        "ja-JP": "Firstbot Carpenter で独自の Anthropic キーを使用します。 キーは、デバイス上で安全かつローカルにのみ保存されます。 いつでもアクセスを取り消すことができます。 キーを設定することで、Kios Tech Int. Ltd. の利用規約とデータプライバシーポリシーに同意したものとみなされます。 API キーを作成するには、Anthropic のドキュメントを参照してください。",
        "ko-KR": "Firstbot Carpenter에서 자체 Anthropic 키를 사용하십시오. 키는 장치에 안전하고 로컬로만 저장됩니다. 언제든지 액세스를 취소할 수 있습니다. 키를 설정하면 Kios Tech Int. Ltd.의 서비스 약관 및 데이터 개인 정보 보호 정책에 동의하는 것으로 간주됩니다. API 키를 만들려면 Anthropic 문서를 확인하십시오.",
        "ar-AE": "استخدم مفتاح Anthropic الخاص بك مع Firstbot Carpenter. سيتم تخزين المفتاح بشكل آمن ومحليًا فقط على جهازك. يمكنك إلغاء الوصول في أي وقت. من خلال تعيين المفتاح ، تقبل شروط الخدمة وسياسة الخصوصية لـ Kios Tech Int. Ltd. تحقق من وثائق Anthropic لإنشاء مفتاح API.",
        "ar-SA": "استخدم مفتاح Anthropic الخاص بك مع Firstbot Carpenter. سيتم تخزين المفتاح بشكل آمن ومحليًا فقط على جهازك. يمكنك إلغاء الوصول في أي وقت. من خلال تعيين المفتاح ، تقبل شروط الخدمة وسياسة الخصوصية لـ Kios Tech Int. Ltd. تحقق من وثائق Anthropic لإنشاء مفتاح API.",
        "bg-BG": "Използвайте собствения си ключ Anthropic с Firstbot Carpenter. Ключът ще бъде съхранен сигурно и локално САМО на вашето устройство. Можете да отмените достъпа по всяко време. Чрез задаване на ключа приемате условията за обслужване и политиката за поверителност на данните на Kios Tech Int. Ltd. Проверете документацията на Anthropic, за да създадете API ключ.",
        "cs-CZ": "Použijte svůj vlastní klíč Anthropic s Firstbot Carpenter. Klíč bude uložen bezpečně a pouze lokálně POUZE na vašem zařízení. Kdykoli můžete přístup zrušit. Nastavením klíče souhlasíte s podmínkami služby a zásadami ochrany osobních údajů společnosti Kios Tech Int. Ltd. Podívejte se do dokumentace Anthropic, jak vytvořit klíč API.",
        "da-DK": "Brug din egen Anthropic-nøgle med Firstbot Carpenter. Nøglen gemmes sikkert og lokalt KUN på din enhed. Du kan tilbagekalde adgangen når som helst. Ved at indstille nøglen accepterer du Kios Tech Int. Ltd.'s servicevilkår og databeskyttelsespolitik. Se Anthropic-dokumentationen for at oprette en API-nøgle.",
        "de-DE": "Verwenden Sie Ihren eigenen Anthropic-Schlüssel mit Firstbot Carpenter. Der Schlüssel wird sicher und lokal NUR auf Ihrem Gerät gespeichert. Sie können den Zugriff jederzeit widerrufen. Durch das Festlegen des Schlüssels akzeptieren Sie die Nutzungsbedingungen und Datenschutzrichtlinien von Kios Tech Int. Ltd. Überprüfen Sie die Anthropic-Dokumentation, um einen API-Schlüssel zu erstellen.",
        "el-GR": "Χρησιμοποιήστε το δικό σας κλειδί Anthropic με τον Firstbot Carpenter. Το κλειδί θα αποθηκευτεί με ασφάλεια και τοπικά ΜΟΝΟ στη συσκευή σας. Μπορείτε να ανακαλέσετε την πρόσβαση ανά πάσα στιγμή. Με την ρύθμιση του κλειδιού, αποδέχεστε τους όρους χρήσης και την πολιτική απορρήτου δεδομένων της Kios Tech Int. Ltd. Ελέγξτε την τεκμηρίωση του Anthropic για να δημιουργήσετε ένα κλειδί API.",
        "fi-FI": "Käytä omaa Anthropic-avaintasi Firstbot Carpenterin kanssa. Avain tallennetaan turvallisesti ja paikallisesti VAIN laitteeseesi. Voit peruuttaa pääsyn milloin tahansa. Asettamalla avaimen hyväksyt Kios Tech Int. Ltd:n palveluehdot ja tietosuojakäytännön. Tarkista Anthropic-dokumentaatiosta API-avaimen luomiseksi.",
        "fil-PH": "Gamitin ang iyong sariling Anthropic key kasama ang Firstbot Carpenter. Ang key ay ligtas at lokal na naka-imbak LAMANG sa iyong device. Maaari mong bawiin ang access anumang oras. Sa pamamagitan ng pag-set ng key, tinatanggap mo ang mga terms of service at data privacy policy ng Kios Tech Int. Ltd. Tingnan ang Anthropic documentation upang lumikha ng API key.",
        "fr-CA": "Utilisez votre propre clé Anthropic avec Firstbot Carpenter. La clé sera stockée de manière sécurisée et localement UNIQUEMENT sur votre appareil. Vous pouvez révoquer l'accès à tout moment. En définissant la clé, vous acceptez les conditions de service et la politique de confidentialité des données de Kios Tech Int. Ltd. Consultez la documentation Anthropic pour créer une clé API.",
        "fr-FR": "Utilisez votre propre clé Anthropic avec Firstbot Carpenter. La clé sera stockée de manière sécurisée et localement UNIQUEMENT sur votre appareil. Vous pouvez révoquer l'accès à tout moment. En définissant la clé, vous acceptez les conditions de service et la politique de confidentialité des données de Kios Tech Int. Ltd. Consultez la documentation Anthropic pour créer une clé API.",
        "hi-IN": "Firstbot Carpenter के साथ अपनी खुद की Anthropic कुंजी का उपयोग करें। कुंजी को सुरक्षित और स्थानीय रूप से केवल आपके डिवाइस पर ही स्टोर किया जाएगा। आप किसी भी समय एक्सेस रद्द कर सकते हैं। कुंजी सेट करके, आप Kios Tech Int. Ltd. की सेवा की शर्तें और डेटा गोपनीयता नीति स्वीकार करते हैं। API कुंजी बनाने के लिए Anthropic डॉक्यूमेंटेशन की जांच करें।",
        "hr-HR": "Koristite svoj vlastiti Anthropic ključ s Firstbot Carpenterom. Ključ će se sigurno i lokalno SPREMATI SAMO na vaš uređaj. U bilo kojem trenutku možete opozvati pristup. Postavljanjem ključa prihvaćate uvjete usluge i politiku privatnosti podataka tvrtke Kios Tech Int. Ltd. Provjerite Anthropic dokumentaciju za stvaranje API ključa.",
        "id-ID": "Gunakan kunci Anthropic Anda sendiri dengan Firstbot Carpenter. Kunci akan disimpan dengan aman dan lokal HANYA di perangkat Anda. Anda dapat mencabut akses kapan saja. Dengan mengatur kunci, Anda menerima syarat layanan dan kebijakan privasi data Kios Tech Int. Ltd. Periksa dokumentasi Anthropic untuk membuat kunci API.",
        "it-IT": "Utilizza la tua chiave Anthropic con Firstbot Carpenter. La chiave verrà memorizzata in modo sicuro e locale SOLO sul tuo dispositivo. Puoi revocare l'accesso in qualsiasi momento. Impostando la chiave, accetti i termini del servizio e l'informativa sulla privacy dei dati di Kios Tech Int. Ltd. Consulta la documentazione di Anthropic per creare una chiave API.",
        "ms-MY": "Gunakan kunci Anthropic anda sendiri dengan Firstbot Carpenter. Kunci akan disimpan dengan selamat dan tempatan HANYA pada peranti anda. Anda boleh membatalkan akses pada bila-bila masa. Dengan menetapkan kunci, anda menerima terma perkhidmatan dan polisi privasi data Kios Tech Int. Ltd. Semak dokumentasi Anthropic untuk membuat kunci API.",
        "nl-NL": "Gebruik uw eigen Anthropic-sleutel met Firstbot Carpenter. De sleutel wordt veilig en lokaal ALLEEN op uw apparaat opgeslagen. U kunt op elk moment de toegang intrekken. Door de sleutel in te stellen, accepteert u de servicevoorwaarden en het gegevensprivacybeleid van Kios Tech Int. Ltd. Raadpleeg de Anthropic-documentatie om een API-sleutel te maken.",
        "pl-PL": "Użyj własnego klucza Anthropic z Firstbot Carpenter. Klucz będzie przechowywany bezpiecznie i lokalnie TYLKO na Twoim urządzeniu. Możesz w dowolnym momencie wycofać dostęp. Ustawiając klucz, akceptujesz warunki korzystania z usługi i politykę prywatności danych Kios Tech Int. Ltd. Sprawdź dokumentację Anthropic, aby utworzyć klucz API.",
        "pt-BR": "Use sua própria chave Anthropic com o Firstbot Carpenter. A chave será armazenada de forma segura e local SOMENTE em seu dispositivo. Você pode revogar o acesso a qualquer momento. Ao definir a chave, você aceita os termos de serviço e a política de privacidade de dados da Kios Tech Int. Ltd. Consulte a documentação da Anthropic para criar uma chave de API.",
        "pt-PT": "Use a sua própria chave Anthropic com o Firstbot Carpenter. A chave será armazenada de forma segura e local SOMENTE no seu dispositivo. Pode revogar o acesso a qualquer momento. Ao definir a chave, aceita os termos de serviço e a política de privacidade de dados da Kios Tech Int. Ltd. Consulte a documentação da Anthropic para criar uma chave de API.",
        "ro-RO": "Folosiți-vă propria cheie Anthropic cu Firstbot Carpenter. Cheia va fi stocată în siguranță și local DOAR pe dispozitivul dvs. Puteți revoca accesul în orice moment. Prin setarea cheii, acceptați termenii de serviciu și politica de confidențialitate a datelor Kios Tech Int. Ltd. Consultați documentația Anthropic pentru a crea o cheie API.",
        "sk-SK": "Použite svoj vlastný kľúč Anthropic s Firstbot Carpenter. Kľúč bude uložený bezpečne a lokálne LEN na vašom zariadení. Kedykoľvek môžete prístup zrušiť. Nastavením kľúča súhlasíte s podmienkami služby a politikou ochrany osobných údajov spoločnosti Kios Tech Int. Ltd. Pozrite sa do dokumentácie Anthropic, ako vytvoriť kľúč API.",
        "sv-SE": "Använd din egen Anthropic-nyckel med Firstbot Carpenter. Nyckeln lagras säkert och lokalt ENDAST på din enhet. Du kan återkalla åtkomsten när som helst. Genom att ställa in nyckeln accepterar du Kios Tech Int. Ltd:s användarvillkor och dataskyddspolicy. Kontrollera Anthropic-dokumentationen för att skapa en API-nyckel.",
        "ta-IN": "உங்கள் சொந்த Anthropic விசையை Firstbot Carpenter உடன் பயன்படுத்தவும். விசை உங்கள் சாதனத்தில் மட்டும் பாதுகாப்பாக மற்றும் இடமற்றப்பட்டது. நீங்கள் எந்த நேரத்திலும் அணுகலை ரத்து செய்யலாம். விசையை அமைத்தால், நீங்கள் Kios Tech Int. Ltd. இன் சேவை விதிகளை மற்றும் தரவு தனியுரிமை கொள்கையை ஏற்றுக்கொள்ளும். API விசை உருவாக்க காண்க Anthropic ஆவணத்தை.",
        "tr-TR": "Kendi Anthropic anahtarınızı Firstbot Carpenter ile kullanın. Anahtarınız sadece cihazınızda güvenli ve yerel olarak saklanacaktır. Her zaman erişimi iptal edebilirsiniz. Anahtarı ayarlayarak, Kios Tech Int. Ltd.'nin hizmet şartlarını ve veri gizlilik politikasını kabul etmiş olursunuz. Bir API anahtarı oluşturmak için Anthropic belgelerine bakın.",
        "uk-UA": "Використовуйте свій власний ключ Anthropic з Firstbot Carpenter. Ключ буде збережено безпечно та локально ЛИШЕ на вашому пристрої. Ви можете в будь-який момент відкликати доступ. Встановлюючи ключ, ви приймаєте умови обслуговування та політику конфіденційності даних Kios Tech Int. Ltd. Перевірте документацію Anthropic, щоб створити ключ API."
    },
    "cancel": {
        "en-US": "Cancel",
        "en-AU": "Cancel",
        "en-CA": "Cancel",
        "en-GB": "Cancel",
        "es-ES": "Cancelar",
        "es-MX": "Cancelar",
        "zh-HK": "取消",
        "zh-TW": "取消",
        "zh-CN": "取消",
        "ja-JP": "キャンセル",
        "ko-KR": "취소",
        "ar-AE": "إلغاء",
        "ar-SA": "إلغاء",
        "bg-BG": "Отказ",
        "cs-CZ": "Zrušit",
        "da-DK": "Annuller",
        "de-DE": "Abbrechen",
        "el-GR": "Ακύρωση",
        "fi-FI": "Peruuta",
        "fil-PH": "Kanselahin",
        "fr-CA": "Annuler",
        "fr-FR": "Annuler",
        "hi-IN": "रद्द करें",
        "hr-HR": "Otkaži",
        "id-ID": "Batal",
        "it-IT": "Annulla",
        "ms-MY": "Batal",
        "nl-NL": "Annuleren",
        "pl-PL": "Anuluj",
        "pt-BR": "Cancelar",
        "pt-PT": "Cancelar",
        "ro-RO": "Anulare",
        "sk-SK": "Zrušiť",
        "sv-SE": "Avbryt",
        "ta-IN": "ரத்து செய்",
        "tr-TR": "İptal",
        "uk-UA": "Скасувати"
    },
    "save": {
        "en-US": "Save",
        "en-AU": "Save",
        "en-CA": "Save",
        "en-GB": "Save",
        "es-ES": "Guardar",
        "es-MX": "Guardar",
        "zh-HK": "保存",
        "zh-TW": "保存",
        "zh-CN": "保存",
        "ja-JP": "保存",
        "ko-KR": "저장",
        "ar-AE": "حفظ",
        "ar-SA": "حفظ",
        "bg-BG": "Запази",
        "cs-CZ": "Uložit",
        "da-DK": "Gem",
        "de-DE": "Speichern",
        "el-GR": "Αποθήκευση",
        "fi-FI": "Tallenna",
        "fil-PH": "I-save",
        "fr-CA": "Enregistrer",
        "fr-FR": "Enregistrer",
        "hi-IN": "सहेजें",
        "hr-HR": "Spremi",
        "id-ID": "Simpan",
        "it-IT": "Salva",
        "ms-MY": "Simpan",
        "nl-NL": "Opslaan",
        "pl-PL": "Zapisz",
        "pt-BR": "Salvar",
        "pt-PT": "Guardar",
        "ro-RO": "Salvare",
        "sk-SK": "Uložiť",
        "sv-SE": "Spara",
        "ta-IN": "சேமி",
        "tr-TR": "Kaydet",
        "uk-UA": "Зберегти"
    },
    "error": {
        "en-US": "Error",
        "en-AU": "Error",
        "en-CA": "Error",
        "en-GB": "Error",
        "es-ES": "Error",
        "es-MX": "Error",
        "zh-HK": "錯誤",
        "zh-TW": "錯誤",
        "zh-CN": "错误",
        "ja-JP": "エラー",
        "ko-KR": "오류",
        "ar-AE": "خطأ",
        "ar-SA": "خطأ",
        "bg-BG": "Грешка",
        "cs-CZ": "Chyba",
        "da-DK": "Fejl",
        "de-DE": "Fehler",
        "el-GR": "Σφάλμα",
        "fi-FI": "Virhe",
        "fil-PH": "Kamalian",
        "fr-CA": "Erreur",
        "fr-FR": "Erreur",
        "hi-IN": "त्रुटि",
        "hr-HR": "Greška",
        "id-ID": "Kesalahan",
        "it-IT": "Errore",
        "ms-MY": "Ralat",
        "nl-NL": "Fout",
        "pl-PL": "Błąd",
        "pt-BR": "Erro",
        "pt-PT": "Erro",
        "ro-RO": "Eroare",
        "sk-SK": "Chyba",
        "sv-SE": "Fel",
        "ta-IN": "பிழை",
        "tr-TR": "Hata",
        "uk-UA": "Помилка"
    },
    "emptyStringErr": {
        "en-US": "Please enter a valid value",
        "en-AU": "Please enter a valid value",
        "en-CA": "Please enter a valid value",
        "en-GB": "Please enter a valid value",
        "es-ES": "Por favor, introduzca un valor válido",
        "es-MX": "Por favor, introduzca un valor válido",
        "zh-HK": "請輸入有效值",
        "zh-TW": "請輸入有效值",
        "zh-CN": "请输入有效值",
        "ja-JP": "有効な値を入力してください",
        "ko-KR": "유효한 값을 입력하세요",
        "ar-AE": "يرجى إدخال قيمة صالحة",
        "ar-SA": "يرجى إدخال قيمة صالحة",
        "bg-BG": "Моля, въведете валидна стойност",
        "cs-CZ": "Zadejte platnou hodnotu",
        "da-DK": "Angiv en gyldig værdi",
        "de-DE": "Bitte geben Sie einen gültigen Wert ein",
        "el-GR": "Εισαγάγετε μια έγκυρη τιμή",
        "fi-FI": "Anna kelvollinen arvo",
        "fil-PH": "Mangyaring magpasok ng wastong halaga",
        "fr-CA": "Veuillez entrer une valeur valide",
        "fr-FR": "Veuillez entrer une valeur valide",
        "hi-IN": "कृपया एक मान्य मान दर्ज करें",
        "hr-HR": "Unesite valjanu vrijednost",
        "id-ID": "Harap masukkan nilai yang valid",
        "it-IT": "Inserisci un valore valido",
        "ms-MY": "Sila masukkan nilai yang sah",
        "nl-NL": "Voer een geldige waarde in",
        "pl-PL": "Wprowadź prawidłową wartość",
        "pt-BR": "Por favor, insira um valor válido",
        "pt-PT": "Por favor, insira um valor válido",
        "ro-RO": "Introduceți o valoare validă",
        "sk-SK": "Zadajte platnú hodnotu",
        "sv-SE": "Ange ett giltigt värde",
        "ta-IN": "செல்லுபடியான மதிப்பை உள்ளிடவும்",
        "tr-TR": "Lütfen geçerli bir değer girin",
        "uk-UA": "Будь ласка, введіть дійсне значення"
    },
    "invalidApiKeyErr": {
        "en-US": "Please enter a valid API key",
        "en-AU": "Please enter a valid API key",
        "en-CA": "Please enter a valid API key",
        "en-GB": "Please enter a valid API key",
        "es-ES": "Por favor, introduzca una clave de API válida",
        "es-MX": "Por favor, introduzca una clave de API válida",
        "zh-HK": "請輸入有效的 API 金鑰",
        "zh-TW": "請輸入有效的 API 金鑰",
        "zh-CN": "请输入有效的 API 密钥",
        "ja-JP": "有効な API キーを入力してください",
        "ko-KR": "유효한 API 키를 입력하세요",
        "ar-AE": "يرجى إدخال مفتاح API صالح",
        "ar-SA": "يرجى إدخال مفتاح API صالح",
        "bg-BG": "Моля, въведете валиден API ключ",
        "cs-CZ": "Zadejte platný klíč API",
        "da-DK": "Angiv en gyldig API-nøgle",
        "de-DE": "Bitte geben Sie einen gültigen API-Schlüssel ein",
        "el-GR": "Εισαγάγετε ένα έγκυρο κλειδί API",
        "fi-FI": "Anna kelvollinen API-avain",
        "fil-PH": "Mangyaring magpasok ng wastong API key",
        "fr-CA": "Veuillez entrer une clé API valide",
        "fr-FR": "Veuillez entrer une clé API valide",
        "hi-IN": "कृपया एक मान्य API कुंजी दर्ज करें",
        "hr-HR": "Unesite valjanu API ključ",
        "id-ID": "Harap masukkan kunci API yang valid",
        "it-IT": "Inserisci una chiave API valida",
        "ms-MY": "Sila masukkan kunci API yang sah",
        "nl-NL": "Voer een geldige API-sleutel in",
        "pl-PL": "Wprowadź prawidłowy klucz API",
        "pt-BR": "Por favor, insira uma chave de API válida",
        "pt-PT": "Por favor, insira uma chave de API válida",
        "ro-RO": "Introduceți o cheie API validă",
        "sk-SK": "Zadajte platný kľúč API",
        "sv-SE": "Ange en giltig API-nyckel",
        "ta-IN": "செல்லுபடியான API விசையை உள்ளிடவும்",
        "tr-TR": "Lütfen geçerli bir API anahtarı girin",
        "uk-UA": "Будь ласка, введіть дійсний ключ API"
    },
    "success": {
        "en-US": "Success",
        "en-AU": "Success",
        "en-CA": "Success",
        "en-GB": "Success",
        "es-ES": "Éxito",
        "es-MX": "Éxito",
        "zh-HK": "成功",
        "zh-TW": "成功",
        "zh-CN": "成功",
        "ja-JP": "成功",
        "ko-KR": "성공",
        "ar-AE": "نجاح",
        "ar-SA": "نجاح",
        "bg-BG": "Успех",
        "cs-CZ": "Úspěch",
        "da-DK": "Succes",
        "de-DE": "Erfolg",
        "el-GR": "Επιτυχία",
        "fi-FI": "Onnistui",
        "fil-PH": "Tagumpay",
        "fr-CA": "Succès",
        "fr-FR": "Succès",
        "hi-IN": "सफलता",
        "hr-HR": "Uspjeh",
        "id-ID": "Berhasil",
        "it-IT": "Successo",
        "ms-MY": "Berjaya",
        "nl-NL": "Succes",
        "pl-PL": "Sukces",
        "pt-BR": "Sucesso",
        "pt-PT": "Sucesso",
        "ro-RO": "Succes",
        "sk-SK": "Úspech",
        "sv-SE": "Lyckades",
        "ta-IN": "வெற்றி",
        "tr-TR": "Başarılı",
        "uk-UA": "Успіх"
    },
    "apiKeySaved": {
        "en-US": "API key saved successfully",
        "en-AU": "API key saved successfully",
        "en-CA": "API key saved successfully",
        "en-GB": "API key saved successfully",
        "es-ES": "Clave de API guardada con éxito",
        "es-MX": "Clave de API guardada con éxito",
        "zh-HK": "API 金鑰已成功保存",
        "zh-TW": "API 金鑰已成功保存",
        "zh-CN": "API 密钥已成功保存",
        "ja-JP": "API キーが正常に保存されました",
        "ko-KR": "API 키가 성공적으로 저장되었습니다",
        "ar-AE": "تم حفظ مفتاح API بنجاح",
        "ar-SA": "تم حفظ مفتاح API بنجاح",
        "bg-BG": "API ключът е успешно запазен",
        "cs-CZ": "Klíč API byl úspěšně uložen",
        "da-DK": "API-nøglen blev gemt med succes",
        "de-DE": "API-Schlüssel erfolgreich gespeichert",
        "el-GR": "Το κλειδί API αποθηκεύτηκε με επιτυχία",
        "fi-FI": "API-avain tallennettu onnistuneesti",
        "fil-PH": "Matagumpay na na-save ang API key",
        "fr-CA": "Clé API enregistrée avec succès",
        "fr-FR": "Clé API enregistrée avec succès",
        "hi-IN": "API कुंजी सफलतापूर्वक सहेजी गई",
        "hr-HR": "API ključ uspješno spremljen",
        "id-ID": "Kunci API berhasil disimpan",
        "it-IT": "Chiave API salvata con successo",
        "ms-MY": "Kunci API berjaya disimpan",
        "nl-NL": "API-sleutel succesvol opgeslagen",
        "pl-PL": "Klucz API został pomyślnie zapisany",
        "pt-BR": "Chave de API salva com sucesso",
        "pt-PT": "Chave de API salva com sucesso",
        "ro-RO": "Cheia API a fost salvată cu succes",
        "sk-SK": "Kľúč API bol úspešne uložený",
        "sv-SE": "API-nyckeln sparades framgångsrikt",
        "ta-IN": "API விசை வெற்றிகரமாக சேமிக்கப்பட்டது",
        "tr-TR": "API anahtarı başarıyla kaydedildi",
        "uk-UA": "Ключ API успішно збережено"
    },
    "setupApiKeyDesToUse": {
        "en-US": "Setup your API key to use Firstbot Carpenter",
        "en-AU": "Setup your API key to use Firstbot Carpenter",
        "en-CA": "Setup your API key to use Firstbot Carpenter",
        "en-GB": "Setup your API key to use Firstbot Carpenter",
        "es-ES": "Configura tu clave de API para usar Firstbot Carpenter",
        "es-MX": "Configura tu clave de API para usar Firstbot Carpenter",
        "zh-HK": "設置您的 API 金鑰以使用 Firstbot Carpenter",
        "zh-TW": "設置您的 API 金鑰以使用 Firstbot Carpenter",
        "zh-CN": "设置您的 API 密钥以使用 Firstbot Carpenter",
        "ja-JP": "Firstbot Carpenter を使用するための API キーを設定します",
        "ko-KR": "Firstbot Carpenter를 사용하려면 API 키를 설정하세요",
        "ar-AE": "قم بإعداد مفتاح API الخاص بك لاستخدام Firstbot Carpenter",
        "ar-SA": "قم بإعداد مفتاح API الخاص بك لاستخدام Firstbot Carpenter",
        "bg-BG": "Настройте своя API ключ, за да използвате Firstbot Carpenter",
        "cs-CZ": "Nastavte svůj klíč API pro použití Firstbot Carpenter",
        "da-DK": "Opsæt din API-nøgle til brug af Firstbot Carpenter",
        "de-DE": "Richten Sie Ihren API-Schlüssel ein, um Firstbot Carpenter zu verwenden",
        "el-GR": "Ρυθμίστε το κλειδί API σας για χρήση του Firstbot Carpenter",
        "fi-FI": "Aseta API-avain käyttääksesi Firstbot Carpenteria",
        "fil-PH": "I-setup ang iyong API key upang gamitin ang Firstbot Carpenter",
        "fr-CA": "Configurez votre clé API pour utiliser Firstbot Carpenter",
        "fr-FR": "Configurez votre clé API pour utiliser Firstbot Carpenter",
        "hi-IN": "Firstbot Carpenter का उपयोग करने के लिए अपनी API कुंजी को सेटअप करें",
        "hr-HR": "Postavite svoj API ključ za korištenje Firstbot Carpenter",
        "id-ID": "Atur kunci API Anda untuk menggunakan Firstbot Carpenter",
        "it-IT": "Configura la tua chiave API per utilizzare Firstbot Carpenter",
        "ms-MY": "Atur kunci API anda untuk menggunakan Firstbot Carpenter",
        "nl-NL": "Stel uw API-sleutel in om Firstbot Carpenter te gebruiken",
        "pl-PL": "Skonfiguruj swój klucz API, aby korzystać z Firstbot Carpenter",
        "pt-BR": "Configure sua chave de API para usar o Firstbot Carpenter",
        "pt-PT": "Configure a sua chave de API para usar o Firstbot Carpenter",
        "ro-RO": "Configurați cheia API pentru a utiliza Firstbot Carpenter",
        "sk-SK": "Nastavte svoj API kľúč na použitie Firstbot Carpenter",
        "sv-SE": "Ställ in din API-nyckel för att använda Firstbot Carpenter",
        "ta-IN": "பயன்படுத்த Firstbot Carpenter ஐ உபயோகிப்பதற்கு உங்கள் API விசையை அமைக்கவும்",
        "tr-TR": "Firstbot Carpenter'ı kullanmak için API anahtarınızı ayarlayın",
        "uk-UA": "Налаштуйте свій ключ API для використання Firstbot Carpenter"
    },
    "result": {
        "en-US": "Result",
        "en-AU": "Result",
        "en-CA": "Result",
        "en-GB": "Result",
        "es-ES": "Resultado",
        "es-MX": "Resultado",
        "zh-HK": "結果",
        "zh-TW": "結果",
        "zh-CN": "结果",
        "ja-JP": "結果",
        "ko-KR": "결과",
        "ar-AE": "النتيجة",
        "ar-SA": "النتيجة",
        "bg-BG": "Резултат",
        "cs-CZ": "Výsledek",
        "da-DK": "Resultat",
        "de-DE": "Ergebnis",
        "el-GR": "Αποτέλεσμα",
        "fi-FI": "Tulos",
        "fil-PH": "Resulta",
        "fr-CA": "Résultat",
        "fr-FR": "Résultat",
        "hi-IN": "परिणाम",
        "hr-HR": "Rezultat",
        "id-ID": "Hasil",
        "it-IT": "Risultato",
        "ms-MY": "Keputusan",
        "nl-NL": "Resultaat",
        "pl-PL": "Wynik",
        "pt-BR": "Resultado",
        "pt-PT": "Resultado",
        "ro-RO": "Rezultat",
        "sk-SK": "Výsledok",
        "sv-SE": "Resultat",
        "ta-IN": "முடிவு",
        "tr-TR": "Sonuç",
        "uk-UA": "Результат"
    },
    "time": {
        "en-US": "Time",
        "en-AU": "Time",
        "en-CA": "Time",
        "en-GB": "Time",
        "es-ES": "Hora",
        "es-MX": "Hora",
        "zh-HK": "時間",
        "zh-TW": "時間",
        "zh-CN": "时间",
        "ja-JP": "時間",
        "ko-KR": "시간",
        "ar-AE": "الوقت",
        "ar-SA": "الوقت",
        "bg-BG": "Време",
        "cs-CZ": "Čas",
        "da-DK": "Tid",
        "de-DE": "Zeit",
        "el-GR": "Χρόνος",
        "fi-FI": "Aika",
        "fil-PH": "Oras",
        "fr-CA": "Temps",
        "fr-FR": "Temps",
        "hi-IN": "समय",
        "hr-HR": "Vrijeme",
        "id-ID": "Waktu",
        "it-IT": "Tempo",
        "ms-MY": "Masa",
        "nl-NL": "Tijd",
        "pl-PL": "Czas",
        "pt-BR": "Tempo",
        "pt-PT": "Tempo",
        "ro-RO": "Timp",
        "sk-SK": "Čas",
        "sv-SE": "Tid",
        "ta-IN": "நேரம்",
        "tr-TR": "Zaman",
        "uk-UA": "Час"
    },
    "code":{
        "en-US": "Code",
        "en-AU": "Code",
        "en-CA": "Code",
        "en-GB": "Code",
        "es-ES": "Código",
        "es-MX": "Código",
        "zh-HK": "代碼",
        "zh-TW": "代碼",
        "zh-CN": "代码",
        "ja-JP": "コード",
        "ko-KR": "코드",
        "ar-AE": "الرمز",
        "ar-SA": "الرمز",
        "bg-BG": "Код",
        "cs-CZ": "Kód",
        "da-DK": "Kode",
        "de-DE": "Code",
        "el-GR": "Κωδικός",
        "fi-FI": "Koodi",
        "fil-PH": "Kodigo",
        "fr-CA": "Code",
        "fr-FR": "Code",
        "hi-IN": "कोड",
        "hr-HR": "Kod",
        "id-ID": "Kode",
        "it-IT": "Codice",
        "ms-MY": "Kod",
        "nl-NL": "Code",
        "pl-PL": "Kod",
        "pt-BR": "Código",
        "pt-PT": "Código",
        "ro-RO": "Cod",
        "sk-SK": "Kód",
        "sv-SE": "Kod",
        "ta-IN": "குறியீடு",
        "tr-TR": "Kod",
        "uk-UA": "Код"
    },
    "codeSnippetWrittenByAi":{
        "en-US": "Code snippet written by AI, feel free to copy it",
        "en-AU": "Code snippet written by AI, feel free to copy it",
        "en-CA": "Code snippet written by AI, feel free to copy it",
        "en-GB": "Code snippet written by AI, feel free to copy it",
        "es-ES": "Fragmento de código escrito por IA, siéntase libre de copiarlo",
        "es-MX": "Fragmento de código escrito por IA, siéntase libre de copiarlo",
        "zh-HK": "AI 寫的代碼片段，請隨意複製",
        "zh-TW": "AI 寫的代碼片段，請隨意複製",
        "zh-CN": "AI 写的代码片段，请随意复制",
        "ja-JP": "AI によって書かれたコードスニペット、自由にコピーしてください",
        "ko-KR": "AI가 작성한 코드 스니펫입니다. 자유롭게 복사하세요",
        "ar-AE": "مقتطف الكود الذي كتبته الذكاء الاصطناعي، لا تتردد في نسخه",
        "ar-SA": "مقتطف الكود الذي كتبته الذكاء الاصطناعي، لا تتردد في نسخه",
        "bg-BG": "Фрагмент от код, написан от ИИ, не се колебайте да го копирате",
        "cs-CZ": "Kódový úryvek napsaný umělou inteligencí, klidně si ho zkopírujte",
        "da-DK": "Kodeudsnit skrevet af AI, er du velkommen til at kopiere det",
        "de-DE": "Code-Schnipsel, der von KI geschrieben wurde, können Sie ihn gerne kopieren",
        "el-GR": "Κομμάτι κώδικα που έχει γραφτεί από την τεχνητή νοημοσύνη, μη διστάσετε να το αντιγράψετε",
        "fi-FI": "Koodinpätkä, jonka on kirjoittanut tekoäly, voit vapaasti kopioida sen",
        "fil-PH": "Code snippet na isinulat ng AI, maaari mong kopyahin ito",
        "fr-CA": "Extrait de code écrit par l'IA, n'hésitez pas à le copier",
        "fr-FR": "Extrait de code écrit par l'IA, n'hésitez pas à le copier",
        "hi-IN": "कोड स्निपेट जो एआई द्वारा लिखा गया है, इसे कॉपी करने में स्वतंत्र महसूस करें",
        "hr-HR": "Kôdni isječak napisan od strane AI, slobodno ga kopirajte",
        "id-ID": "Potongan kode yang ditulis oleh AI, silakan salin",
        "it-IT": "Snippet di codice scritto da AI, sentiti libero di copiarlo",
        "ms-MY": "Potongan kod yang ditulis oleh AI, sila salin",
        "nl-NL": "Codefragment geschreven door AI, voel je vrij om het te kopiëren",
        "pl-PL": "Fragment kodu napisany przez AI, śmiało go kopiuj",
        "pt-BR": "Trecho de código escrito por IA, sinta-se à vontade para copiá-lo",
        "pt-PT": "Trecho de código escrito por IA, sinta-se à vontade para copiá-lo",
        "ro-RO": "Fragment de cod scris de IA, simte-te liber să-l copiezi",
        "sk-SK": "Kódový úryvok napísaný umelou inteligenciou, neváhajte ho kopírovať",
        "sv-SE": "Kodsnutt skriven av AI, känn dig fri att kopiera den",
        "ta-IN": "ஏஆய் எழுதிய குறியீட்டை நீங்கள் காப்பியிருக்கலாம்",
        "tr-TR": "AI tarafından yazılan kod parçası, istediğiniz gibi kopyalayabilirsiniz",
        "uk-UA": "Фрагмент коду, написаний штучним інтелектом, не соромтеся копіювати"
    },
    "script":{
        "en-US": "Script",
        "en-AU": "Script",
        "en-CA": "Script",
        "en-GB": "Script",
        "es-ES": "Script",
        "es-MX": "Script",
        "zh-HK": "腳本",
        "zh-TW": "腳本",
        "zh-CN": "脚本",
        "ja-JP": "スクリプト",
        "ko-KR": "스크립트",
        "ar-AE": "سيناريو",
        "ar-SA": "سيناريو",
        "bg-BG": "Сценарий",
        "cs-CZ": "Skript",
        "da-DK": "Script",
        "de-DE": "Skript",
        "el-GR": "Σενάριο",
        "fi-FI": "Käsikirjoitus",
        "fil-PH": "Script",
        "fr-CA": "Script",
        "fr-FR": "Script",
        "hi-IN": "स्क्रिप्ट",
        "hr-HR": "Skripta",
        "id-ID": "Script",
        "it-IT": "Script",
        "ms-MY": "Skrip",
        "nl-NL": "Script",
        "pl-PL": "Skrypt",
        "pt-BR": "Script",
        "pt-PT": "Script",
        "ro-RO": "Script",
        "sk-SK": "Skript",
        "sv-SE": "Skript",
        "ta-IN": "ஸ்கிரிப்ட்",
        "tr-TR": "Senaryo",
        "uk-UA": "Сценарій"
    },
    "dependencies":{
        "en-US": "Dependencies",
        "en-AU": "Dependencies",
        "en-CA": "Dependencies",
        "en-GB": "Dependencies",
        "es-ES": "Dependencias",
        "es-MX": "Dependencias",
        "zh-HK": "依賴項",
        "zh-TW": "依賴項",
        "zh-CN": "依赖项",
        "ja-JP": "依存関係",
        "ko-KR": "의존성",
        "ar-AE": "التبعيات",
        "ar-SA": "التبعيات",
        "bg-BG": "Зависимости",
        "cs-CZ": "Závislosti",
        "da-DK": "Afhængigheder",
        "de-DE": "Abhängigkeiten",
        "el-GR": "Εξαρτήσεις",
        "fi-FI": "Riippuvuudet",
        "fil-PH": "Dependencies",
        "fr-CA": "Dépendances",
        "fr-FR": "Dépendances",
        "hi-IN": "डिपेंडेंसीज",
        "hr-HR": "Ovisnosti",
        "id-ID": "Dependencies",
        "it-IT": "Dipendenze",
        "ms-MY": "Dependencies",
        "nl-NL": "Afhankelijkheden",
        "pl-PL": "Zależności",
        "pt-BR": "Dependências",
        "pt-PT": "Dependências",
        "ro-RO": "Dependențe",
        "sk-SK": "Závislosti",
        "sv-SE": "Beroenden",
        "ta-IN": "பகுப்பாய்வுகள்",
        "tr-TR": "Bağımlılıklar",
        "uk-UA": "Залежності"
    },
    "run_params":{
        "en-US": "Run Params",
        "en-AU": "Run Params",
        "en-CA": "Run Params",
        "en-GB": "Run Params",
        "es-ES": "Parámetros de ejecución",
        "es-MX": "Parámetros de ejecución",
        "zh-HK": "運行參數",
        "zh-TW": "運行參數",
        "zh-CN": "运行参数",
        "ja-JP": "実行パラメータ",
        "ko-KR": "실행 매개변수",
        "ar-AE": "معلمات التشغيل",
        "ar-SA": "معلمات التشغيل",
        "bg-BG": "Параметри за изпълнение",
        "cs-CZ": "Spustit parametry",
        "da-DK": "Kør parametre",
        "de-DE": "Ausführungsparameter",
        "el-GR": "Παράμετροι εκτέλεσης",
        "fi-FI": "Suorita parametrit",
        "fil-PH": "Run Params",
        "fr-CA": "Paramètres d'exécution",
        "fr-FR": "Paramètres d'exécution",
        "hi-IN": "चलाएँ पैरामीटर",
        "hr-HR": "Pokreni parametre",
        "id-ID": "Run Params",
        "it-IT": "Esegui parametri",
        "ms-MY": "Run Params",
        "nl-NL": "Uitvoeringsparameters",
        "pl-PL": "Uruchom parametry",
        "pt-BR": "Executar parâmetros",
        "pt-PT": "Executar parâmetros",
        "ro-RO": "Rulați parametrii",
        "sk-SK": "Spustiť parametre",
        "sv-SE": "Kör parametrar",
        "ta-IN": "இயக்க பதிவுகள்",
        "tr-TR": "Çalıştırma Parametreleri",
        "uk-UA": "Параметри запуску"
    },
    "input_schema":{
        "en-US": "Input Schema",
        "en-AU": "Input Schema",
        "en-CA": "Input Schema",
        "en-GB": "Input Schema",
        "es-ES": "Esquema de entrada",
        "es-MX": "Esquema de entrada",
        "zh-HK": "輸入架構",
        "zh-TW": "輸入架構",
        "zh-CN": "输入架构",
        "ja-JP": "入力スキーマ",
        "ko-KR": "입력 스키마",
        "ar-AE": "مخطط الإدخال",
        "ar-SA": "مخطط الإدخال",
        "bg-BG": "Схема за вход",
        "cs-CZ": "Vstupní schéma",
        "da-DK": "Input Schema",
        "de-DE": "Eingabeschema",
        "el-GR": "Σχήμα εισόδου",
        "fi-FI": "Syöteskeema",
        "fil-PH": "Input Schema",
        "fr-CA": "Schéma d'entrée",
        "fr-FR": "Schéma d'entrée",
        "hi-IN": "इनपुट स्कीमा",
        "hr-HR": "Ulazna shema",
        "id-ID": "Input Schema",
        "it-IT": "Schema di input",
        "ms-MY": "Input Schema",
        "nl-NL": "Invoerschema",
        "pl-PL": "Schemat wejściowy",
        "pt-BR": "Esquema de entrada",
        "pt-PT": "Esquema de entrada",
        "ro-RO": "Schema de intrare",
        "sk-SK": "Vstupná schéma",
        "sv-SE": "Ingångsschema",
        "ta-IN": "உள்ளீடு தமிழ்",
        "tr-TR": "Giriş Şeması",
        "uk-UA": "Схема входу"
    },
    "info": {
        "en-US": "Info",
        "en-AU": "Info",
        "en-CA": "Info",
        "en-GB": "Info",
        "es-ES": "Información",
        "es-MX": "Información",
        "zh-HK": "信息",
        "zh-TW": "信息",
        "zh-CN": "信息",
        "ja-JP": "情報",
        "ko-KR": "정보",
        "ar-AE": "معلومات",
        "ar-SA": "معلومات",
        "bg-BG": "Информация",
        "cs-CZ": "Informace",
        "da-DK": "Info",
        "de-DE": "Info",
        "el-GR": "Πληροφορίες",
        "fi-FI": "Tiedot",
        "fil-PH": "Impormasyon",
        "fr-CA": "Info",
        "fr-FR": "Info",
        "hi-IN": "जानकारी",
        "hr-HR": "Informacije",
        "id-ID": "Info",
        "it-IT": "Informazioni",
        "ms-MY": "Maklumat",
        "nl-NL": "Info",
        "pl-PL": "Informacje",
        "pt-BR": "Informações",
        "pt-PT": "Informações",
        "ro-RO": "Informații",
        "sk-SK": "Informácie",
        "sv-SE": "Info",
        "ta-IN": "தகவல்",
        "tr-TR": "Bilgi",
        "uk-UA": "Інформація"
    },
    "copiedToClipboard":{
        "en-US": "Copied to clipboard",
        "en-AU": "Copied to clipboard",
        "en-CA": "Copied to clipboard",
        "en-GB": "Copied to clipboard",
        "es-ES": "Copiado al portapapeles",
        "es-MX": "Copiado al portapapeles",
        "zh-HK": "已複製到剪貼板",
        "zh-TW": "已複製到剪貼板",
        "zh-CN": "已复制到剪贴板",
        "ja-JP": "クリップボードにコピーされました",
        "ko-KR": "클립보드에 복사되었습니다",
        "ar-AE": "تم النسخ إلى الحافظة",
        "ar-SA": "تم النسخ إلى الحافظة",
        "bg-BG": "Копирано в клипборда",
        "cs-CZ": "Zkopírováno do schránky",
        "da-DK": "Kopieret til udklipsholder",
        "de-DE": "In die Zwischenablage kopiert",
        "el-GR": "Αντιγράφηκε στο πρόχειρο",
        "fi-FI": "Kopioitu leikepöydälle",
        "fil-PH": "Kinopya sa clipboard",
        "fr-CA": "Copié dans le presse-papiers",
        "fr-FR": "Copié dans le presse-papiers",
        "hi-IN": "क्लिपबोर्ड पर कॉपी किया गया",
        "hr-HR": "Kopirano u međuspremnik",
        "id-ID": "Disalin ke papan klip",
        "it-IT": "Copiato negli appunti",
        "ms-MY": "Disalin ke papan keratan",
        "nl-NL": "Gekopieerd naar klembord",
        "pl-PL": "Skopiowano do schowka",
        "pt-BR": "Copiado para a área de transferência",
        "pt-PT": "Copiado para a área de transferência",
        "ro-RO": "Copiat în clipboard",
        "sk-SK": "Skopírované do schránky",
        "sv-SE": "Kopierat till urklipp",
        "ta-IN": "கிளிப்போர்டுக்கு நகர்த்தப்பட்டது",
        "tr-TR": "Panoya kopyalandı",
        "uk-UA": "Скопійовано в буфер обміну"
    },
    "run":{
        "en-US": "Run",
        "en-AU": "Run",
        "en-CA": "Run",
        "en-GB": "Run",
        "es-ES": "Ejecutar",
        "es-MX": "Ejecutar",
        "zh-HK": "運行",
        "zh-TW": "運行",
        "zh-CN": "运行",
        "ja-JP": "実行",
        "ko-KR": "실행",
        "ar-AE": "تشغيل",
        "ar-SA": "تشغيل",
        "bg-BG": "Старт",
        "cs-CZ": "Spustit",
        "da-DK": "Kør",
        "de-DE": "Ausführen",
        "el-GR": "Εκτέλεση",
        "fi-FI": "Suorita",
        "fil-PH": "Tumakbo",
        "fr-CA": "Exécuter",
        "fr-FR": "Exécuter",
        "hi-IN": "चलाएँ",
        "hr-HR": "Pokreni",
        "id-ID": "Jalankan",
        "it-IT": "Esegui",
        "ms-MY": "Jalankan",
        "nl-NL": "Uitvoeren",
        "pl-PL": "Uruchom",
        "pt-BR": "Executar",
        "pt-PT": "Executar",
        "ro-RO": "Rulează",
        "sk-SK": "Spustiť",
        "sv-SE": "Kör",
        "ta-IN": "இயக்க",
        "tr-TR": "Çalıştır",
        "uk-UA": "Запустити"
    },
    "fork":{
        "en-US": "Fork",
        "en-AU": "Fork",
        "en-CA": "Fork",
        "en-GB": "Fork",
        "es-ES": "Bifurcar",
        "es-MX": "Bifurcar",
        "zh-HK": "分叉",
        "zh-TW": "分叉",
        "zh-CN": "分叉",
        "ja-JP": "フォーク",
        "ko-KR": "포크",
        "ar-AE": "تفرع",
        "ar-SA": "تفرع",
        "bg-BG": "Форк",
        "cs-CZ": "Fork",
        "da-DK": "Forgrening",
        "de-DE": "Fork",
        "el-GR": "Παράλληλη διακλάδωση",
        "fi-FI": "Haara",
        "fil-PH": "Fork",
        "fr-CA": "Fourche",
        "fr-FR": "Fourche",
        "hi-IN": "फोर्क",
        "hr-HR": "Fork",
        "id-ID": "Fork",
        "it-IT": "Fork",
        "ms-MY": "Fork",
        "nl-NL": "Fork",
        "pl-PL": "Fork",
        "pt-BR": "Fork",
        "pt-PT": "Fork",
        "ro-RO": "Fork",
        "sk-SK": "Fork",
        "sv-SE": "Fork",
        "ta-IN": "Fork",
        "tr-TR": "Fork",
        "uk-UA": "Fork"
    },
    "carpenterPitch":{
        "en-US": "Anyone can become an AI programmer with Carpenter.",
        "en-AU": "Anyone can become an AI programmer with Carpenter.",
        "en-CA": "Anyone can become an AI programmer with Carpenter.",
        "en-GB": "Anyone can become an AI programmer with Carpenter.",
        "es-ES": "Cualquiera puede convertirse en un programador de IA con Carpenter.",
        "es-MX": "Cualquiera puede convertirse en un programador de IA con Carpenter.",
        "zh-HK": "任何人都可以成為 AI 程式設計師。",
        "zh-TW": "任何人都可以成為 AI 程式設計師。",
        "zh-CN": "任何人都可以成为 AI 程序员。",
        "ja-JP": "誰でも Carpenter で AI プログラマーになれます。",
        "ko-KR": "누구나 Carpenter로 AI 프로그래머가 될 수 있습니다.",
        "ar-AE": "يمكن لأي شخص أن يصبح مبرمج AI مع Carpenter.",
        "ar-SA": "يمكن لأي شخص أن يصبح مبرمج AI مع Carpenter.",
        "bg-BG": "Всеки може да стане програмист на изкуствен интелект с Carpenter.",
        "cs-CZ": "Každý se může stát programátorem AI s Carpenter.",
        "da-DK": "Alle kan blive AI-programmør med Carpenter.",
        "de-DE": "Jeder kann mit Carpenter ein KI-Programmierer werden.",
        "el-GR": "Ο καθένας μπορεί να γίνει προγραμματιστής AI με το Carpenter.",
        "fi-FI": "Kuka tahansa voi tulla AI-ohjelmoijaksi Carpenterin avulla.",
        "fil-PH": "Maaaring maging AI programmer ang sinuman gamit ang Carpenter.",
        "fr-CA": "N'importe qui peut devenir un programmeur IA avec Carpenter.",
        "fr-FR": "N'importe qui peut devenir un programmeur IA avec Carpenter.",
        "hi-IN": "कारपेंटर के साथ कोई भी AI प्रोग्रामर बन सकता है।",
        "hr-HR": "Svatko može postati programer AI s Carpenterom.",
        "id-ID": "Siapa pun bisa menjadi programmer AI dengan Carpenter.",
        "it-IT": "Chiunque può diventare un programmatore AI con Carpenter.",
        "ms-MY": "Sesiapa boleh menjadi pengaturcara AI dengan Carpenter.",
        "nl-NL": "Iedereen kan met Carpenter een AI-programmeur worden.",
        "pl-PL": "Każdy może zostać programistą AI z Carpenterem.",
        "pt-BR": "Qualquer pessoa pode se tornar um programador de IA com o Carpenter.",
        "pt-PT": "Qualquer pessoa pode tornar-se programador de IA com o Carpenter.",
        "ro-RO": "Oricine poate deveni programator AI cu Carpenter.",
        "sk-SK": "Každý môže byť programátorom AI s Carpenterom.",
        "sv-SE": "Vem som helst kan bli en AI-programmerare med Carpenter.",
        "ta-IN": "யாரும் கார்பென்டருடன் ஏஆய் பிரோக்ராமராக மாறலாம்.",
        "tr-TR": "Herkes Carpenter ile bir AI programcısı olabilir.",
        "uk-UA": "Кожен може стати програмістом штучного інтелекту з Carpenter."
    },
    "carpenterDes":{
        "en-US": "Use natural language to describe your programming needs, and this AI will generate and execute NodeJS or Python code based on your input.",
        "en-AU": "Use natural language to describe your programming needs, and this AI will generate and execute NodeJS or Python code based on your input.",
        "en-CA": "Use natural language to describe your programming needs, and this AI will generate and execute NodeJS or Python code based on your input.",
        "en-GB": "Use natural language to describe your programming needs, and this AI will generate and execute NodeJS or Python code based on your input.",
        "es-ES": "Utilice el lenguaje natural para describir sus necesidades de programación, y esta IA generará y ejecutará código NodeJS o Python basado en su entrada.",
        "es-MX": "Utilice el lenguaje natural para describir sus necesidades de programación, y esta IA generará y ejecutará código NodeJS o Python basado en su entrada.",
        "zh-HK": "使用自然語言描述您的編程需求，這個 AI 將根據您的輸入生成並執行 NodeJS 或 Python 代碼。",
        "zh-TW": "使用自然語言描述您的編程需求，這個 AI 將根據您的輸入生成並執行 NodeJS 或 Python 代碼。",
        "zh-CN": "使用自然语言描述您的编程需求，这个 AI 将根据您的输入生成并执行 NodeJS 或 Python 代码。",
        "ja-JP": "自然言語を使用してプログラミングニーズを説明し、この AI は入力に基づいて NodeJS または Python コードを生成および実行します。",
        "ko-KR": "자연어를 사용하여 프로그래밍 요구 사항을 설명하면, 이 AI는 입력에 따라 NodeJS 또는 Python 코드를 생성하고 실행합니다.",
        "ar-AE": "استخدم اللغة الطبيعية لوصف احتياجاتك البرمجية، وسيقوم هذا الذكاء الاصطناعي بتوليد وتنفيذ كود NodeJS أو Python بناءً على إدخالك.",
        "ar-SA": "استخدم اللغة الطبيعية لوصف احتياجاتك البرمجية، وسيقوم هذا الذكاء الاصطناعي بتوليد وتنفيذ كود NodeJS أو Python بناءً على إدخالك.",
        "bg-BG": "Използвайте естествения език, за да опишете вашите програмистки нужди, и този ИИ ще генерира и изпълни код NodeJS или Python на базата на вашия вход.",
        "cs-CZ": "Použijte přirozený jazyk k popisu vašich programátorských potřeb a tento AI vygeneruje a provede kód NodeJS nebo Python na základě vašeho vstupu.",
        "da-DK": "Brug naturligt sprog til at beskrive dine programmeringsbehov, og denne AI vil generere og udføre NodeJS- eller Python-kode baseret på din input.",
        "de-DE": "Verwenden Sie natürliche Sprache, um Ihre Programmierbedürfnisse zu beschreiben, und dieser KI wird auf der Grundlage Ihrer Eingabe NodeJS- oder Python-Code generieren und ausführen.",
        "el-GR": "Χρησιμοποιήστε φυσική γλώσσα για να περιγράψετε τις ανάγκες σας στην προγραμματισμό, και αυτή η AI θα δημιουργήσει και θα εκτελέσει κώδικα NodeJS ή Python με βάση την είσοδό σας.",
        "fi-FI": "Käytä luonnollista kieltä kuvaamaan ohjelmointitarpeitasi, ja tämä tekoäly generoi ja suorittaa NodeJS- tai Python-koodin syötteesi perusteella.",
        "fil-PH": "Gamitin ang natural na wika upang ilarawan ang iyong mga pangangailangan sa pagpoprograma, at ang AI na ito ay mag-ge-generate at mag-e-execute ng NodeJS o Python code batay sa iyong input.",
        "fr-CA": "Utilisez un langage naturel pour décrire vos besoins en programmation, et cette IA générera et exécutera du code NodeJS ou Python en fonction de votre entrée.",
        "fr-FR": "Utilisez un langage naturel pour décrire vos besoins en programmation, et cette IA générera et exécutera du code NodeJS ou Python en fonction de votre entrée.",
        "hi-IN": "अपनी प्रोग्रामिंग आवश्यकताओं को वर्णन करने के लिए प्राकृतिक भाषा का उपयोग करें, और यह एआई आपके इनपुट के आधार पर NodeJS या Python कोड उत्पन्न और क्रियान्वित करेगा।",
        "hr-HR": "Koristite prirodni jezik za opis vaših programerskih potreba, a ovaj će AI generirati i izvršiti NodeJS ili Python kod na temelju vašeg unosa.",
        "id-ID": "Gunakan bahasa alami untuk menggambarkan kebutuhan pemrograman Anda, dan AI ini akan menghasilkan dan menjalankan kode NodeJS atau Python berdasarkan masukan Anda.",
        "it-IT": "Usa il linguaggio naturale per descrivere le tue esigenze di programmazione, e questa IA genererà ed eseguirà codice NodeJS o Python in base al tuo input.",
        "ms-MY": "Gunakan bahasa semula jadi untuk menerangkan keperluan pengaturcaraan anda, dan AI ini akan menjana dan melaksanakan kod NodeJS atau Python berdasarkan input anda.",
        "nl-NL": "Gebruik natuurlijke taal om uw programmeerbehoeften te beschrijven, en deze AI zal NodeJS- of Python-code genereren en uitvoeren op basis van uw invoer.",
        "pl-PL": "Użyj języka naturalnego, aby opisać swoje potrzeby programistyczne, a ta AI wygeneruje i wykona kod NodeJS lub Python na podstawie twojego wejścia.",
        "pt-BR": "Use linguagem natural para descrever suas necessidades de programação, e esta IA gerará e executará código NodeJS ou Python com base em sua entrada.",
        "pt-PT": "Use linguagem natural para descrever suas necessidades de programação, e esta IA gerará e executará código NodeJS ou Python com base em sua entrada.",
        "ro-RO": "Folosiți limbajul natural pentru a descrie nevoile dvs. de programare, iar această IA va genera și executa cod NodeJS sau Python pe baza introducerii dvs.",
        "sk-SK": "Použite prirodzený jazyk na popísanie vašich programátorských potrieb a tento AI vygeneruje a vykoná kód NodeJS alebo Python na základe vášho vstupu.",
        "sv-SE": "Använd naturligt språk för att beskriva dina programmeringsbehov, och denna AI kommer att generera och köra NodeJS- eller Python-kod baserat på din inmatning.",
        "ta-IN": "உங்கள் நிரலாக்க தேவைகளை விவரிக்க இயல்பான மொழியைப் பயன்படுத்துங்கள், மற்றும் இந்த ஏஆய் உங்கள் உள்ளீட்டின் அடிப்படையில் NodeJS அல்லது Python குறியீடை உருவாக்கி நிறைவுபடுத்தும்.",
        "tr-TR": "Programlama ihtiyaçlarınızı açıklamak için doğal dil kullanın ve bu AI, girişinize dayanarak NodeJS veya Python kodu oluşturacak ve çalıştıracaktır.",
        "uk-UA": "Використовуйте природну мову для опису своїх програмістських потреб, і цей ШІ згенерує та виконає код NodeJS або Python на основі вашого вводу."
    },
    "setup":{
        "en-US": "Setup",
        "en-AU": "Setup",
        "en-CA": "Setup",
        "en-GB": "Setup",
        "es-ES": "Configuración",
        "es-MX": "Configuración",
        "zh-HK": "設置",
        "zh-TW": "設置",
        "zh-CN": "设置",
        "ja-JP": "セットアップ",
        "ko-KR": "설정",
        "ar-AE": "إعداد",
        "ar-SA": "إعداد",
        "bg-BG": "Настройка",
        "cs-CZ": "Nastavení",
        "da-DK": "Opsætning",
        "de-DE": "Einrichtung",
        "el-GR": "Ρύθμιση",
        "fi-FI": "Asetus",
        "fil-PH": "Setup",
        "fr-CA": "Configuration",
        "fr-FR": "Configuration",
        "hi-IN": "सेटअप",
        "hr-HR": "Postavljanje",
        "id-ID": "Penyiapan",
        "it-IT": "Impostazione",
        "ms-MY": "Penyediaan",
        "nl-NL": "Opzetten",
        "pl-PL": "Konfiguracja",
        "pt-BR": "Configuração",
        "pt-PT": "Configuração",
        "ro-RO": "Configurare",
        "sk-SK": "Nastavenie",
        "sv-SE": "Installation",
        "ta-IN": "அமைப்பு",
        "tr-TR": "Kurulum",
        "uk-UA": "Налаштування"
    },
    "noRuntimeResult": {
        "en-US": "No runtime result.",
        "en-AU": "No runtime result.",
        "en-CA": "No runtime result.",
        "en-GB": "No runtime result.",
        "es-ES": "Sin resultado en tiempo de ejecución.",
        "es-MX": "Sin resultado en tiempo de ejecución.",
        "zh-HK": "沒有運行時結果。",
        "zh-TW": "沒有運行時結果。",
        "zh-CN": "没有运行时结果。",
        "ja-JP": "ランタイム結果なし。",
        "ko-KR": "런타임 결과 없음.",
        "ar-AE": "لا توجد نتيجة تشغيل.",
        "ar-SA": "لا توجد نتيجة تشغيل.",
        "bg-BG": "Няма резултат от времето на изпълнение.",
        "cs-CZ": "Žádný výsledek spuštění.",
        "da-DK": "Ingen kørselresultat.",
        "de-DE": "Kein Laufzeit-Ergebnis.",
        "el-GR": "Χωρίς αποτέλεσμα χρόνου εκτέλεσης.",
        "fi-FI": "Ei suoritusaikatulosta.",
        "fil-PH": "Walang resulta ng runtime.",
        "fr-CA": "Aucun résultat d'exécution.",
        "fr-FR": "Aucun résultat d'exécution.",
        "hi-IN": "कोई रनटाइम परिणाम नहीं।",
        "hr-HR": "Nema rezultata izvođenja.",
        "id-ID": "Tidak ada hasil runtime.",
        "it-IT": "Nessun risultato di runtime.",
        "ms-MY": "Tiada hasil runtime.",
        "nl-NL": "Geen runtime-resultaat.",
        "pl-PL": "Brak wyniku czasu wykonania.",
        "pt-BR": "Nenhum resultado de tempo de execução.",
        "pt-PT": "Nenhum resultado de tempo de execução.",
        "ro-RO": "Niciun rezultat de timp de rulare.",
        "sk-SK": "Žiadny výsledok spustenia.",
        "sv-SE": "Inget körtidsresultat.",
        "ta-IN": "ரன்டைம் முடிவு இல்லை.",
        "tr-TR": "Çalışma zamanı sonucu yok.",
        "uk-UA": "Немає результату виконання."
    },
    "useMessageTemplate":{
        "en-US": "Please try any of the follwing template messages : ",
        "en-AU": "Please try any of the follwing template messages : ",
        "en-CA": "Please try any of the follwing template messages : ",
        "en-GB": "Please try any of the follwing template messages : ",
        "es-ES": "Por favor, prueba cualquiera de los siguientes mensajes de plantilla: ",
        "es-MX": "Por favor, prueba cualquiera de los siguientes mensajes de plantilla: ",
        "zh-HK": "請嘗試以下任何模板消息：",
        "zh-TW": "請嘗試以下任何模板消息：",
        "zh-CN": "请尝试以下任何模板消息：",
        "ja-JP": "次のテンプレートメッセージのいずれかをお試しください：",
        "ko-KR": "다음 템플릿 메시지 중 하나를 시도하십시오 :",
        "ar-AE": "يرجى تجربة أي من رسائل القالب التالية: ",
        "ar-SA": "يرجى تجربة أي من رسائل القالب التالية: ",
        "bg-BG": "Моля, опитайте някое от следните шаблонни съобщения: ",
        "cs-CZ": "Zkuste některou z následujících šablonových zpráv: ",
        "da-DK": "Prøv venligst en af følgende skabelonbeskeder: ",
        "de-DE": "Bitte versuchen Sie eine der folgenden Vorlagen-Nachrichten: ",
        "el-GR": "Παρακαλώ δοκιμάστε οποιοδήποτε από τα ακόλουθα μηνύματα προτύπου: ",
        "fi-FI": "Kokeile jotakin seuraavista malliviesteistä: ",
        "fil-PH": "Subukan ang alinman sa mga sumusunod na mensahe ng template: ",
        "fr-CA": "Veuillez essayer l'un des messages de modèle suivants : ",
        "fr-FR": "Veuillez essayer l'un des messages de modèle suivants : ",
        "hi-IN": "कृपया निम्नलिखित किसी भी टेम्पलेट संदेश का प्रयास करें : ",
        "hr-HR": "Molimo pokušajte bilo koju od sljedećih predložaka poruka: ",
        "id-ID": "Silakan coba salah satu pesan templat berikut : ",
        "it-IT": "Si prega di provare uno dei seguenti messaggi di modello: ",
        "ms-MY": "Sila cuba mana-mana mesej templat berikut : ",
        "nl-NL": "Probeer een van de volgende sjabloonberichten : ",
        "pl-PL": "Proszę spróbować dowolnej z następujących wiadomości szablonowych : ",
        "pt-BR": "Por favor, tente qualquer uma das seguintes mensagens de modelo : ",
        "pt-PT": "Por favor, tente qualquer uma das seguintes mensagens de modelo : ",
        "ro-RO": "Vă rugăm să încercați oricare dintre următoarele mesaje de șablon : ",
        "sk-SK": "Skúste niektorú z nasledujúcich šablónových správ: ",
        "sv-SE": "Var god försök något av följande mallmeddelanden : ",
        "ta-IN": "கீழ்க்குள்ள உதாரண அஞ்சல்களிலிருந்து எந்தவொரு வார்த்தைகளையும் முயற்சிக்கவும் : ",
        "tr-TR": "Lütfen aşağıdaki şablon mesajlardan herhangi birini deneyin : ",
        "uk-UA": "Спробуйте будь-яке з наступних шаблонних повідомлень : "
    },
    "templateMsg1":{
        "en-US": "Write Python function for even numbers.",
        "en-AU": "Write Python function for even numbers.",
        "en-CA": "Write Python function for even numbers.",
        "en-GB": "Write Python function for even numbers.",
        "es-ES": "Escribir una función de Python para números pares.",
        "es-MX": "Escribir una función de Python para números pares.",
        "zh-HK": "為偶數寫 Python 函數。",
        "zh-TW": "為偶數寫 Python 函數。",
        "zh-CN": "为偶数写 Python 函数。",
        "ja-JP": "偶数のための Python 関数を書く。",
        "ko-KR": "짝수를 위한 Python 함수 작성.",
        "ar-AE": "كتابة وظيفة Python للأرقام الزوجية.",
        "ar-SA": "كتابة وظيفة Python للأرقام الزوجية.",
        "bg-BG": "Напишете Python функция за четни числа.",
        "cs-CZ": "Napište Python funkci pro sudá čísla.",
        "da-DK": "Skriv Python-funktion til lige tal.",
        "de-DE": "Python-Funktion für gerade Zahlen schreiben.",
        "el-GR": "Γράψτε συνάρτηση Python για άρτιους αριθμούς.",
        "fi-FI": "Kirjoita Python-funktio parillisille numeroille.",
        "fil-PH": "Magsulat ng Python function para sa mga even numbers.",
        "fr-CA": "Écrire une fonction Python pour les nombres pairs.",
        "fr-FR": "Écrire une fonction Python pour les nombres pairs.",
        "hi-IN": "समान संख्याओं के लिए Python फ़ंक्शन लिखें।",
        "hr-HR": "Napišite Python funkciju za parne brojeve.",
        "id-ID": "Menulis fungsi Python untuk angka genap.",
        "it-IT": "Scrivi una funzione Python per i numeri pari.",
        "ms-MY": "Tulis fungsi Python untuk nombor genap.",
        "nl-NL": "Schrijf Python-functie voor even getallen.",
        "pl-PL": "Napisz funkcję Python dla liczb parzystych.",
        "pt-BR": "Escreva uma função Python para números pares.",
        "pt-PT": "Escreva uma função Python para números pares.",
        "ro-RO": "Scrieți o funcție Python pentru numere pare.",
        "sk-SK": "Napíšte Python funkciu pre párne čísla.",
        "sv-SE": "Skriv Python-funktion för jämna nummer.",
        "ta-IN": "சமம் எண்களுக்கான பைதான் செயலியை எழுதுங்கள்.",
        "tr-TR": "Çift sayılar için Python işlevi yazın.",
        "uk-UA": "Напишіть функцію Python для парних чисел."
    },
    "templateMsgDetail1":{
        "en-US": "Would you help me write a python function which gets me the even numbers within a user-supplied function input number. The function will only return the result in a list of numbers ONLY. Try to test the function with tools available. The user-supplied function input this time is 99. tell me the result or error if any.",
        "en-AU": "Would you help me write a python function which gets me the even numbers within a user-supplied function input number. The function will only return the result in a list of numbers ONLY. Try to test the function with tools available. The user-supplied function input this time is 99. tell me the result or error if any.",
        "en-CA": "Would you help me write a python function which gets me the even numbers within a user-supplied function input number. The function will only return the result in a list of numbers ONLY. Try to test the function with tools available. The user-supplied function input this time is 99. tell me the result or error if any.",
        "en-GB": "Would you help me write a python function which gets me the even numbers within a user-supplied function input number. The function will only return the result in a list of numbers ONLY. Try to test the function with tools available. The user-supplied function input this time is 99. tell me the result or error if any.",
        "es-ES": "¿Me ayudarías a escribir una función de Python que me dé los números pares dentro de un número de entrada de función suministrado por el usuario? La función solo devolverá el resultado en una lista de números. Intenta probar la función con las herramientas disponibles. La entrada de función suministrada por el usuario esta vez es 99. Dime el resultado o el error si lo hay.",
        "es-MX": "¿Me ayudarías a escribir una función de Python que me dé los números pares dentro de un número de entrada de función suministrado por el usuario? La función solo devolverá el resultado en una lista de números. Intenta probar la función con las herramientas disponibles. La entrada de función suministrada por el usuario esta vez es 99. Dime el resultado o el error si lo hay.",
        "zh-HK": "你能幫我寫一個 Python 函數嗎？這個函數會在用戶提供的函數輸入數字中找到偶數。這個函數只會以數字列表的形式返回結果。請嘗試使用可用的工具測試這個函數。這次用戶提供的函數輸入是 99。告訴我結果或錯誤（如果有的話）。",
        "zh-TW": "你能幫我寫一個 Python 函數嗎？這個函數會在用戶提供的函數輸入數字中找到偶數。這個函數只會以數字列表的形式返回結果。請嘗試使用可用的工具測試這個函數。這次用戶提供的函數輸入是 99。告訴我結果或錯誤（如果有的話）。",
        "zh-CN": "你能帮我写一个 Python 函数吗？这个函数会在用户提供的函数输入数字中找到偶数。这个函数只会以数字列表的形式返回结果。请尝试使用可用的工具测试这个函数。这次用户提供的函数输入是 99。告诉我结果或错误（如果有的话）。",
        "ja-JP": "Python 関数を書くのを手伝ってくれますか？この関数は、ユーザーが提供した関数入力番号内の偶数を取得します。この関数は、結果を数字のリストの形式でのみ返します。利用可能なツールでこの関数をテストしてみてください。今回のユーザー提供の関数入力は 99 です。結果またはエラー（あれば）を教えてください。",
        "ko-KR": "Python 함수를 작성하는 데 도와주실 수 있나요? 이 함수는 사용자가 제공한 함수 입력 숫자 내에서 짝수를 찾습니다. 이 함수는 결과를 숫자 목록 형식으로만 반환합니다. 사용 가능한 도구로 이 함수를 테스트해보십시오. 이번에 사용자가 제공한 함수 입력은 99입니다. 결과 또는 오류(있는 경우)를 알려주세요.",
        "ar-AE": "هل تساعدني في كتابة وظيفة Python تحصل لي على الأرقام الزوجية ضمن رقم الإدخال الذي يتم توفيره من قبل المستخدم. ستقوم الوظيفة بإرجاع النتيجة فقط في قائمة من الأرقام فقط. حاول اختبار الوظيفة باستخدام الأدوات المتاحة. رقم الإدخال الذي يتم توفيره من قبل المستخدم هذه المرة هو 99. قل لي النتيجة أو الخطأ إذا كان هناك.",
        "ar-SA": "هل تساعدني في كتابة وظيفة Python تحصل لي على الأرقام الزوجية ضمن رقم الإدخال الذي يتم توفيره من قبل المستخدم. ستقوم الوظيفة بإرجاع النتيجة فقط في قائمة من الأرقام فقط. حاول اختبار الوظيفة باستخدام الأدوات المتاحة. رقم الإدخال الذي يتم توفيره من قبل المستخدم هذه المرة هو 99. قل لي النتيجة أو الخطأ إذا كان هناك.",
        "bg-BG": "Бихте ли ми помогнали да напиша функция на Python, която ми дава четните числа във функционалното число, предоставено от потребителя. Функцията ще върне резултата само в списък с числа. Опитайте да тествате функцията с наличните инструменти. Входното функционално число, предоставено от потребителя този път, е 99. Кажете ми резултата или грешката, ако има такава.",
        "cs-CZ": "Pomůžete mi napsat Python funkci, která mi získá sudá čísla v uživatelem zadaném čísle funkce. Funkce vrátí výsledek pouze v seznamu čísel. Zkuste funkci otestovat s dostupnými nástroji. Uživatelem zadané číslo funkce tentokrát je 99. Řekněte mi výsledek nebo chybu, pokud existuje.",
        "da-DK": "Vil du hjælpe mig med at skrive en python-funktion, der giver mig de lige tal inden for et brugerleveret funktionsinputnummer. Funktionen vil kun returnere resultatet i en liste over tal KUN. Prøv at teste funktionen med de tilgængelige værktøjer. Brugerleveret funktionsinput denne gang er 99. fortæl mig resultatet eller fejlen, hvis nogen.",
        "de-DE": "Könnten Sie mir helfen, eine Python-Funktion zu schreiben, die mir die geraden Zahlen innerhalb einer vom Benutzer bereitgestellten Funktions-Eingabezahl gibt. Die Funktion gibt das Ergebnis nur in einer Liste von Zahlen zurück. Versuchen Sie, die Funktion mit verfügbaren Tools zu testen. Die vom Benutzer bereitgestellte Funktions-Eingabe ist dieses Mal 99. Sagen Sie mir das Ergebnis oder den Fehler, wenn vorhanden.",
        "el-GR": "Θα μπορούσες να με βοηθήσεις να γράψω μια συνάρτηση Python που μου δίνει τους άρτιους αριθμούς μέσα σε έναν αριθμό εισόδου συνάρτησης που παρέχεται από τον χρήστη. Η συνάρτηση θα επιστρέψει το αποτέλεσμα μόνο σε μια λίστα αριθμών. Δοκίμασε να δοκιμάσεις τη συνάρτηση με τα διαθέσιμα εργαλεία. Η είσοδος συνάρτησης που παρέχεται από τον χρήστη αυτή τη φορά είναι 99. πες μου το αποτέλεσμα ή το σφάλμα αν υπάρχει.",
        "fi-FI": "Voisitko auttaa minua kirjoittamaan Python-funktion, joka antaa minulle parilliset numerot käyttäjän toimittamassa funktio syöttönumerossa. Funktio palauttaa tuloksen vain numeroiden listassa. Yritä testata funktiota käytettävissä olevilla työkaluilla. Käyttäjän toimittama funktio syöttö tällä kertaa on 99. kerro minulle tulos tai virhe, jos sellainen on.",
        "fil-PH": "Matutulungan mo ba akong magsulat ng isang python function na nagbibigay sa akin ng mga even numbers sa loob ng isang user-supplied function input number. Ang function ay magbibigay lamang ng resulta sa isang listahan ng mga numero LAMANG. Subukan ang function gamit ang mga tools na available. Ang user-supplied function input ngayon ay 99. sabihin mo sa akin ang resulta o error kung meron.",
        "fr-CA": "Pouvez-vous m'aider à écrire une fonction Python qui me donne les nombres pairs dans un nombre d'entrée de fonction fourni par l'utilisateur. La fonction ne renverra le résultat que dans une liste de nombres UNIQUEMENT. Essayez de tester la fonction avec les outils disponibles. Le nombre d'entrée de fonction fourni par l'utilisateur cette fois est 99. dites-moi le résultat ou l'erreur s'il y en a.",
        "fr-FR": "Pouvez-vous m'aider à écrire une fonction Python qui me donne les nombres pairs dans un nombre d'entrée de fonction fourni par l'utilisateur. La fonction ne renverra le résultat que dans une liste de nombres UNIQUEMENT. Essayez de tester la fonction avec les outils disponibles. Le nombre d'entrée de fonction fourni par l'utilisateur cette fois est 99. dites-moi le résultat ou l'erreur s'il y en a.",
        "hi-IN": "क्या आप मेरी मदद करेंगे और मुझे एक पायथन फ़ंक्शन लिखने में मदद करेंगे जो एक उपयोगकर्ता द्वारा प्रदान किए गए फ़ंक्शन इनपुट नंबर के भीतर समान संख्याएँ प्राप्त करता है। फ़ंक्शन केवल नंबर की सूची में परिणाम देगा। उपलब्ध उपकरणों के साथ फ़ंक्शन का परीक्षण करने की कोशिश करें। इस बार उपयोगकर्ता द्वारा प्रदान किए गए फ़ंक्शन इनपुट 99 है। मुझे परिणाम या त्रुटि बताएं अगर कोई हो।",
        "hr-HR": "Biste li mi pomogli napisati Python funkciju koja mi daje parne brojeve unutar broja ulazne funkcije koju je korisnik dostavio. Funkcija će rezultat vratiti samo u listi brojeva SAMO. Pokušajte testirati funkciju s dostupnim alatima. Ulazna funkcija koju je korisnik dostavio ovaj put je 99. recite mi rezultat ili grešku ako postoji.",
        "id-ID": "Bisakah Anda membantu saya menulis fungsi python yang memberikan saya angka genap dalam nomor input fungsi yang disediakan pengguna. Fungsi hanya akan mengembalikan hasil dalam daftar angka SAJA. Coba uji fungsi dengan alat yang tersedia. Input fungsi yang disediakan pengguna kali ini adalah 99. beritahu saya hasil atau kesalahan jika ada.",
        "it-IT": "Mi aiuteresti a scrivere una funzione python che mi fornisce i numeri pari all'interno di un numero di input funzione fornito dall'utente. La funzione restituirà il risultato solo in un elenco di numeri SOLO. Prova a testare la funzione con gli strumenti disponibili. L'input funzione fornito dall'utente questa volta è 99. dimmi il risultato o l'errore se presente.",
        "ms-MY": "Bolehkah anda membantu saya menulis fungsi python yang memberikan saya nombor genap dalam nombor input fungsi yang dibekalkan pengguna. Fungsi hanya akan mengembalikan hasil dalam senarai nombor SAHAJA. Cuba uji fungsi dengan alat yang ada. Input fungsi yang dibekalkan pengguna kali ini adalah 99. beritahu saya hasil atau ralat jika ada.",
        "nl-NL": "Kunt u mij helpen bij het schrijven van een python-functie die mij de even getallen geeft binnen een door de gebruiker geleverd functie-invoernummer. De functie geeft het resultaat alleen terug in een lijst met getallen ALLEEN. Probeer de functie te testen met beschikbare tools. De door de gebruiker geleverde functie-invoer is dit keer 99. vertel me het resultaat of de fout als die er is.",
        "pl-PL": "Czy pomożesz mi napisać funkcję python, która zwraca mi parzyste liczby w podanym przez użytkownika numerze wejściowym funkcji. Funkcja zwróci wynik tylko w liście liczb TYLKO. Spróbuj przetestować funkcję za pomocą dostępnych narzędzi. Wprowadzony przez użytkownika numer funkcji tym razem to 99. powiedz mi wynik lub błąd, jeśli taki istnieje.",
        "pt-BR": "Você me ajudaria a escrever uma função python que me dá os números pares dentro de um número de entrada de função fornecido pelo usuário. A função só retornará o resultado em uma lista de números APENAS. Tente testar a função com as ferramentas disponíveis. A entrada de função fornecida pelo usuário desta vez é 99. me diga o resultado ou erro se houver.",
        "pt-PT": "Você me ajudaria a escrever uma função python que me dá os números pares dentro de um número de entrada de função fornecido pelo usuário. A função só retornará o resultado em uma lista de números APENAS. Tente testar a função com as ferramentas disponíveis. A entrada de função fornecida pelo usuário desta vez é 99. me diga o resultado ou erro se houver.",
        "ro-RO": "Mă puteți ajuta să scriu o funcție Python care îmi oferă numerele pare într-un număr de intrare de funcție furnizat de utilizator. Funcția va returna rezultatul doar într-o listă de numere DOAR. Încercați să testați funcția cu instrumentele disponibile. Intrarea de funcție furnizată de utilizator de data aceasta este 99. spuneți-mi rezultatul sau eroarea dacă există.",
        "sk-SK": "Pomôžete mi napísať Python funkciu, ktorá mi poskytne párne čísla v čísle vstupnej funkcie, ktoré používateľ poskytol. Funkcia vráti výsledok iba v zozname čísel LEN. Skúste funkciu otestovať s dostupnými nástrojmi. Vstupná funkcia, ktorú používateľ poskytol tentoraz, je 99. povedzte mi výsledok alebo chybu, ak existuje.",
        "sv-SE": "Skulle du kunna hjälpa mig att skriva en python-funktion som ger mig jämna nummer inom ett användarlevererat funktionsinmatningsnummer. Funktionen kommer endast att returnera resultatet i en lista med nummer ENDAST. Försök att testa funktionen med tillgängliga verktyg. Användarlevererad funktionsinmatning den här gången är 99. berätta för mig resultatet eller felet om något.",
        "ta-IN": "நீங்கள் எனக்கு உபயோகிக்கும் பயனர் வழியாக வழங்கப்பட்ட செயல்பாடு உள்ள எண்ணின் உள்ளிட்ட செயல்பாடு எல்லா எண்களையும் எனக்கு பெறுகிற பைதான் செயலியை எழுத உதவுவாரா? இந்த செயலியில் மட்டும் எண்களின் பட்டியலில் மட்டும் முடிவை மட்டும் திருப்பும். கிடைக்கும் கருவிகளோடு இந்த செயலியை சேர்ந்து சோதிக்க முயற்சிக்கவும். இந்த முறையான பயனர் வழியாக உள்ளிட்ட செயல்பாடு 99 ஆகும். எனக்கு எந்த ம முடிவை அல்லது பிழையை சொல்லுங்கள்.",
        "tr-TR": "Bana kullanıcı tarafından sağlanan bir işlev giriş numarası içindeki çift sayıları veren bir python işlevi yazmama yardım eder misiniz? Fonksiyon yalnızca sonucu SADECE sayı listesinde döndürecektir. Mevcut araçlarla işlevi test etmeye çalışın. Bu sefer kullanıcı tarafından sağlanan işlev girişi 99'dur. sonucu veya hata durumunu bana söyleyin.",
        "uk-UA": "Чи допоможете мені написати функцію Python, яка дозволяє мені отримувати парні числа в межах числа введення функції, яке надається користувачем. Функція поверне результат лише у списку чисел ТІЛЬКИ. Спробуйте протестувати функцію за допомогою доступних інструментів. Число введення функції, надане користувачем цього разу, - 99. скажіть мені результат або помилку, якщо така є."
    },
    "templateMsg2":{
        "en-US": "Write Node.js timezone time function.",
        "en-AU": "Write Node.js timezone time function.",
        "en-CA": "Write Node.js timezone time function.",
        "en-GB": "Write Node.js timezone time function.",
        "es-ES": "Escribir una función de tiempo de zona horaria Node.js.",
        "es-MX": "Escribir una función de tiempo de zona horaria Node.js.",
        "zh-HK": "為 Node.js 寫時區時間函數。",
        "zh-TW": "為 Node.js 寫時區時間函數。",
        "zh-CN": "为 Node.js 写时区时间函数。",
        "ja-JP": "Node.js タイムゾーン時間関数を書く。",
        "ko-KR": "Node.js 시간대 시간 함수 작성.",
        "ar-AE": "كتابة وظيفة وقت المنطقة الزمنية Node.js.",
        "ar-SA": "كتابة وظيفة وقت المنطقة الزمنية Node.js.",
        "bg-BG": "Напишете функция за часовата зона на Node.js.",
        "cs-CZ": "Napište funkci časového pásma Node.js.",
        "da-DK": "Skriv Node.js tidszonefunktion.",
        "de-DE": "Node.js Zeitzone Zeitfunktion schreiben.",
        "el-GR": "Γράψτε τη λειτουργία ώρας ζώνης Node.js.",
        "fi-FI": "Kirjoita Node.js aikavyöhykefunktio.",
        "fil-PH": "Magsulat ng Node.js timezone time function.",
        "fr-CA": "Écrire une fonction de temps de fuseau horaire Node.js.",
        "fr-FR": "Écrire une fonction de temps de fuseau horaire Node.js.",
        "hi-IN": "Node.js समय क्षेत्र समय कार्य को लिखें।",
        "hr-HR": "Napišite Node.js funkciju vremenske zone.",
        "id-ID": "Menulis fungsi waktu zona Node.js.",
        "it-IT": "Scrivi la funzione di tempo del fuso orario Node.js.",
        "ms-MY": "Tulis fungsi masa zon Node.js.",
        "nl-NL": "Schrijf Node.js tijdzone tijd functie.",
        "pl-PL": "Napisz funkcję czasu strefy czasowej Node.js.",
        "pt-BR": "Escreva a função de tempo de fuso horário Node.js.",
        "pt-PT": "Escreva a função de tempo de fuso horário Node.js.",
        "ro-RO": "Scrieți funcția de timp a zonei orare Node.js.",
        "sk-SK": "Napíšte funkciu časového pásma Node.js.",
        "sv-SE": "Skriv Node.js tidszonstidsfunktion.",
        "ta-IN": "Node.js நேர மண்டல் நேர செயலியை எழுதுங்கள்.",
        "tr-TR": "Node.js zaman dilimi zaman işlevini yazın.",
        "uk-UA": "Напишіть функцію часового поясу Node.js."
    },
    "templateMsgDetail2":{
        "en-US": "Write a nodejs function that can return the any time of different timezone for me now, return the value. Make sure the function has a arugment which is the timezone. Test run it along with arugment : HK timezone",
        "en-AU": "Write a nodejs function that can return the any time of different timezone for me now, return the value. Make sure the function has a arugment which is the timezone. Test run it along with arugment : HK timezone",
        "en-CA": "Write a nodejs function that can return the any time of different timezone for me now, return the value. Make sure the function has a arugment which is the timezone. Test run it along with arugment : HK timezone",
        "en-GB": "Write a nodejs function that can return the any time of different timezone for me now, return the value. Make sure the function has a arugment which is the timezone. Test run it along with arugment : HK timezone",
        "es-ES": "Escribe una función de nodejs que pueda devolverme la hora de cualquier zona horaria diferente para mí ahora, devuelve el valor. Asegúrate de que la función tenga un argumento que sea la zona horaria. Ejecútalo junto con el argumento: zona horaria de HK",
        "es-MX": "Escribe una función de nodejs que pueda devolverme la hora de cualquier zona horaria diferente para mí ahora, devuelve el valor. Asegúrate de que la función tenga un argumento que sea la zona horaria. Ejecútalo junto con el argumento: zona horaria de HK",
        "zh-HK": "為我寫一個 nodejs 函數，現在可以為我返回不同時區的任何時間，返回值。確保函數有一個參數，即時區。與參數一起測試運行：HK 時區",
        "zh-TW": "為我寫一個 nodejs 函數，現在可以為我返回不同時區的任何時間，返回值。確保函數有一個參數，即時區。與參數一起測試運行：HK 時區",
        "zh-CN": "为我写一个 nodejs 函数，现在可以为我返回不同时区的任何时间，返回值。确保函数有一个参数，即时区。与参数一起测试运行：HK 时区",
        "ja-JP": "私のために異なるタイムゾーンの任意の時間を返す nodejs 関数を書いてください。値を返します。関数にはタイムゾーンである引数があることを確認してください。引数と一緒にテスト実行してください：HK タイムゾーン",
        "ko-KR": "지금 나를 위해 다른 시간대의 어떤 시간이든 반환할 수 있는 nodejs 함수를 작성하십시오. 값을 반환합니다. 함수에는 시간대 인수가 있어야합니다. 인수와 함께 테스트 실행 : HK 시간대",
        "ar-AE": "اكتب وظيفة nodejs يمكنها إعادة أي وقت من منطقة زمنية مختلفة لي الآن ، وإعادة القيمة. تأكد من أن الوظيفة لديها arugment وهو المنطقة الزمنية. تشغيل الاختبار مع arugment: منطقة زمنية HK",
        "ar-SA": "اكتب وظيفة nodejs يمكنها إعادة أي وقت من منطقة زمنية مختلفة لي الآن ، وإعادة القيمة. تأكد من أن الوظيفة لديها arugment وهو المنطقة الزمنية. تشغيل الاختبار مع arugment: منطقة زمنية HK",
        "bg-BG": "Напишете функция на nodejs, която може да ми върне всяко време от различна часова зона сега, върнете стойността. Уверете се, че функцията има аргумент, който е часовата зона. Тествайте го заедно с аргумента: HK часова зона",
        "cs-CZ": "Napište funkci nodejs, která mi nyní může vrátit jakýkoli čas z různého časového pásma, vraťte hodnotu. Ujistěte se, že funkce má argument, který je časové pásmo. Spusťte test spolu s argumentem: HK časové pásmo",
        "da-DK": "Skriv en nodejs-funktion, der kan returnere enhver tid fra en anden tidszone for mig nu, returnere værdien. Sørg for, at funktionen har et argument, der er tidszonen. Testkør det sammen med argumentet: HK tidszone",
        "de-DE": "Schreiben Sie eine nodejs-Funktion, die mir jetzt die beliebige Zeit einer anderen Zeitzone zurückgeben kann, geben Sie den Wert zurück. Stellen Sie sicher, dass die Funktion ein Argument hat, das die Zeitzone ist. Testen Sie es zusammen mit dem Argument: HK-Zeitzone",
        "el-GR": "Γράψτε μια λειτουργία nodejs που μπορεί να μου επιστρέψει την οποιαδήποτε ώρα μιας διαφορετικής ζώνης τώρα, επιστρέψτε την τιμή. Βεβαιωθείτε ότι η λειτουργία έχει ένα όρισμα που είναι η ζώνη ώρας. Δοκιμάστε το μαζί με το όρισμα: Ζώνη ώρας HK",
        "fi-FI": "Kirjoita nodejs-funktio, joka voi palauttaa minulle nyt minkä tahansa aikavyöhykkeen ajan, palauta arvo. Varmista, että funktiolla on argumentti, joka on aikavyöhyke. Testaa se yhdessä argumentin kanssa: HK aikavyöhyke",
        "fil-PH": "Magsulat ng isang nodejs function na maaaring ibalik ang anumang oras ng iba't ibang timezone para sa akin ngayon, ibalik ang halaga. Siguruhing may arugment ang function na ito na ang timezone. Subukan itong patakbuhin kasama ang arugment: HK timezone",
        "fr-CA": "Écrivez une fonction nodejs qui peut me renvoyer n'importe quel moment d'un fuseau horaire différent pour moi maintenant, renvoyez la valeur. Assurez-vous que la fonction a un argument qui est le fuseau horaire. Testez-le avec l'argument : fuseau horaire HK",
        "fr-FR": "Écrivez une fonction nodejs qui peut me renvoyer n'importe quel moment d'un fuseau horaire différent pour moi maintenant, renvoyez la valeur. Assurez-vous que la fonction a un argument qui est le fuseau horaire. Testez-le avec l'argument : fuseau horaire HK",
        "hi-IN": "मेरे लिए एक नोडज्स फ़ंक्शन लिखें जो मुझे अब किसी भी समय क्षेत्र का समय दे सकता है, मूल्य वापस दें। सुनिश्चित करें कि फ़ंक्शन में एक ऐरगमेंट है जो समय क्षेत्र है। इसे एरगमेंट के साथ टेस्ट रन करें: HK समय क्षेत्र",
        "hr-HR": "Napišite nodejs funkciju koja mi može vratiti bilo koje vrijeme različite vremenske zone za mene sada, vratiti vrijednost. Pazite da funkcija ima argument koji je vremenska zona. Testirajte ga zajedno s argumentom: HK vremenska zona",
        "id-ID": "Tulis fungsi nodejs yang dapat mengembalikan waktu zona waktu yang berbeda untuk saya sekarang, kembalikan nilai. Pastikan fungsi memiliki argumen yang merupakan zona waktu. Uji jalankan bersama dengan argumen: zona waktu HK",
        "it-IT": "Scrivi una funzione nodejs che può restituirmi ora qualsiasi fuso orario diverso per me ora, restituisci il valore. Assicurati che la funzione abbia un argomento che sia il fuso orario. Provalo insieme all'argomento: fuso orario HK",
        "ms-MY": "Tulis fungsi nodejs yang boleh mengembalikan masa zon masa yang berbeza untuk saya sekarang, kembalikan nilai. Pastikan fungsi mempunyai arugment yang merupakan zon masa. Uji jalankan bersama dengan arugment: zon masa HK",
        "nl-NL": "Schrijf een nodejs-functie die nu elk tijdstip van een andere tijdzone voor mij kan retourneren, retourneer de waarde. Zorg ervoor dat de functie een argument heeft dat de tijdzone is. Test het samen met het argument: HK-tijdzone",
        "pl-PL": "Napisz funkcję nodejs, która może zwrócić mi teraz dowolny czas z innej strefy czasowej, zwróć wartość. Upewnij się, że funkcja ma argument, który jest strefą czasową. Uruchom test razem z argumentem: strefa czasowa HK",
        "pt-BR": "Escreva uma função nodejs que pode me retornar qualquer hora de um fuso horário diferente para mim agora, retorne o valor. Certifique-se de que a função tenha um argumento que seja o fuso horário. Teste-o junto com o argumento: fuso horário HK",
        "pt-PT": "Escreva uma função nodejs que pode me retornar qualquer hora de um fuso horário diferente para mim agora, retorne o valor. Certifique-se de que a função tenha um argumento que seja o fuso horário. Teste-o junto com o argumento: fuso horário HK",
        "ro-RO": "Scrieți o funcție nodejs care poate returna orice oră dintr-o altă fus orar pentru mine acum, returnați valoarea. Asigurați-vă că funcția are un argument care este fusul orar. Testați-l împreună cu argumentul: fus orar HK",
        "sk-SK": "Napíšte funkciu nodejs, ktorá mi teraz môže vrátiť akýkoľvek čas z iného časového pásma, vrátiť hodnotu. Uistite sa, že funkcia má argument, ktorý je časové pásmo. Spustite test spolu s argumentom: HK časové pásmo",
        "sv-SE": "Skriv en nodejs-funktion som kan returnera vilken tid som helst från en annan tidszon för mig nu, returnera värdet. Se till att funktionen har ett argument som är tidszonen. Testkör det tillsammans med argumentet: HK tidszon",
        "ta-IN": "எனக்கு இப்போது வெற்றிகரமாக எந்த நேரமும் எனக்கு வேறு நேர மண்டலிலிருந்து திரும்பலாம் என்று ஒரு நோட்ஜ்ஸ் செயல்பாடு எழுதுங்கள், மதிப்பை திரும்பப் பதிவு செய்யலாம். செயல்பாடுக்கு ஒரு உத்தரவாதாரம் உள்ளது என்று உறுதிசெய்க. சோதனை இதனுடன் ஒருங்கிணைந்து இயக்குங்கள்: HK நேர மண்டலம்",
        "tr-TR": "Şu anda benim için farklı bir zaman diliminden herhangi bir zamanı döndürebilecek bir nodejs işlevi yazın, değeri döndürün. İşlevin zaman dilimi olan bir argümanı olduğundan emin olun. Argümanla birlikte test çalıştırın: HK zaman dilimi",
        "uk-UA": "Напишіть функцію nodejs, яка може повернути мені будь-який час з іншого часового поясу зараз, повернути значення. Переконайтеся, що функція має аргумент, який є часовим поясом. Тестуйте його разом з аргументом: часовий пояс HK"
    },
    "howToSetupAnthropicAPIKey":{
        "en-US": "How to setup Anthropic API key?",
        "en-AU": "How to setup Anthropic API key?",
        "en-CA": "How to setup Anthropic API key?",
        "en-GB": "How to setup Anthropic API key?",
        "es-ES": "¿Cómo configurar la clave de API de Anthropic?",
        "es-MX": "¿Cómo configurar la clave de API de Anthropic?",
        "zh-HK": "如何設置 Anthropic API 金鑰？",
        "zh-TW": "如何設置 Anthropic API 金鑰？",
        "zh-CN": "如何设置 Anthropic API 密钥？",
        "ja-JP": "Anthropic API キーの設定方法",
        "ko-KR": "Anthropic API 키 설정 방법",
        "ar-AE": "كيفية إعداد مفتاح API Anthropic؟",
        "ar-SA": "كيفية إعداد مفتاح API Anthropic؟",
        "bg-BG": "Как да настроите ключа на Anthropic API?",
        "cs-CZ": "Jak nastavit klíč Anthropic API?",
        "da-DK": "Sådan opsættes Anthropic API-nøgle?",
        "de-DE": "Wie richte ich den Anthropic API-Schlüssel ein?",
        "el-GR": "Πώς να ρυθμίσετε το κλειδί API της Anthropic;",
        "fi-FI": "Kuinka asennetaan Anthropic API-avain?",
        "fil-PH": "Paano i-setup ang Anthropic API key?",
        "fr-CA": "Comment configurer la clé API Anthropic?",
        "fr-FR": "Comment configurer la clé API Anthropic?",
        "hi-IN": "Anthropic API कुंजी कैसे सेटअप करें?",
        "hr-HR": "Kako postaviti ključ Anthropic API?",
        "id-ID": "Bagaimana cara menyiapkan kunci API Anthropic?",
        "it-IT": "Come configurare la chiave API di Anthropic?",
        "ms-MY": "Bagaimana untuk setup kunci API Anthropic?",
        "nl-NL": "Hoe stel je de Anthropic API-sleutel in?",
        "pl-PL": "Jak skonfigurować klucz API Anthropic?",
        "pt-BR": "Como configurar a chave da API Anthropic?",
        "pt-PT": "Como configurar a chave da API Anthropic?",
        "ro-RO": "Cum să configurați cheia API Anthropic?",
        "sk-SK": "Ako nastaviť kľúč Anthropic API?",
        "sv-SE": "Ange en giltig API-nyckel",
        "ta-IN": "எப்படி அந்த்ரோபிக் API விசையை அமைக்கலாம்?",
        "tr-TR": "Anthropic API anahtarını nasıl kurulur?",
        "uk-UA": "Як налаштувати ключ API Anthropic?"
    },
    "privacyPolicy": {
      "ar-AE": "سياسة الخصوصية",
      "ar-SA": "سياسة الخصوصية",
      "bg-BG": "Политика за поверителност",
      "cs-CZ": "Zásady ochrany osobních údajů",
      "da-DK": "Fortrolighedspolitik",
      "de-DE": "Datenschutzrichtlinie",
      "el-GR": "Πολιτική Απορρήτου",
      "en-AU": "Privacy Policy",
      "en-CA": "Privacy Policy",
      "en-GB": "Privacy Policy",
      "en-US": "Privacy Policy",
      "es-ES": "Política de privacidad",
      "es-MX": "Política de privacidad",
      "fi-FI": "Tietosuojakäytäntö",
      "fil-PH": "Patakaran sa Privacy",
      "fr-CA": "Politique de confidentialité",
      "fr-FR": "Politique de confidentialité",
      "hi-IN": "गोपनीयता नीति",
      "hr-HR": "Politika privatnosti",
      "id-ID": "Kebijakan Privasi",
      "it-IT": "Politica sulla privacy",
      "ja-JP": "プライバシーポリシー",
      "ko-KR": "개인정보 처리방침",
      "ms-MY": "Dasar Privasi",
      "nl-NL": "Privacybeleid",
      "pl-PL": "Polityka prywatności",
      "pt-BR": "Política de Privacidade",
      "pt-PT": "Política de Privacidade",
      "ro-RO": "Politica de confidențialitate",
      "sk-SK": "Zásady ochrany osobných údajov",
      "sv-SE": "Integritetspolicy",
      "ta-IN": "தனியுரிமைக் கொள்கை",
      "tr-TR": "Gizlilik Politikası",
      "uk-UA": "Політика конфіденційності",
      "zh-CN": "隐私政策",
      "zh-HK": "隱私政策",
      "zh-TW": "隱私政策"
    },
    "slogan":{
        "en-US": "Become an AI programmer with Open Carpenter.",
        "en-AU": "Become an AI programmer with Open Carpenter.",
        "en-CA": "Become an AI programmer with Open Carpenter.",
        "en-GB": "Become an AI programmer with Open Carpenter.",
        "es-ES": "Conviértete en programador de IA con Open Carpenter.",
        "es-MX": "Conviértete en programador de IA con Open Carpenter.",
        "zh-HK": "Open Carpenter 令你成為一位 AI 程式設計師。",
        "zh-TW": "Open Carpenter 令你成為一位 AI 程式設計師。",
        "zh-CN": "Open Carpenter 让您成为 AI 程序员。",
        "ja-JP": "Open CarpenterでAIプログラマーになる。",
        "ko-KR": "Open Carpenter로 AI 프로그래머가 되세요.",
        "ar-AE": "كن مبرمجًا للذكاء الاصطناعي مع Open Carpenter.",
        "ar-SA": "كن مبرمجًا للذكاء الاصطناعي مع Open Carpenter.",
        "bg-BG": "Станете програмист на изкуствен интелект с Open Carpenter.",
        "cs-CZ": "Staňte se programátorem AI s Open Carpenter.",
        "da-DK": "Bliv en AI-programmør med Open Carpenter.",
        "de-DE": "Werden Sie AI-Programmierer mit Open Carpenter.",
        "el-GR": "Γίνετε προγραμματιστής AI με το Open Carpenter.",
        "fi-FI": "Tule AI-ohjelmoijaksi Open Carpenterin kanssa.",
        "fil-PH": "Maging isang AI programmer sa Open Carpenter.",
        "fr-CA": "Devenez programmeur IA avec Open Carpenter.",
        "fr-FR": "Devenez programmeur IA avec Open Carpenter.",
        "hi-IN": "Open Carpenter के साथ एक AI प्रोग्रामर बनें।",
        "hr-HR": "Postanite programer AI s Open Carpenterom.",
        "id-ID": "Menjadi programmer AI dengan Open Carpenter.",
        "it-IT": "Diventa un programmatore AI con Open Carpenter.",
        "ms-MY": "Menjadi seorang pengaturcara AI dengan Open Carpenter.",
        "nl-NL": "Word een AI-programmeur met Open Carpenter.",
        "pl-PL": "Zostań programistą AI z Open Carpenter.",
        "pt-BR": "Torne-se um programador de IA com Open Carpenter.",
        "pt-PT": "Torne-se um programador de IA com Open Carpenter.",
        "ro-RO": "Deveniți programator AI cu Open Carpenter.",
        "sk-SK": "Staňte sa programátorom AI s Open Carpenter.",
        "sv-SE": "Bli en AI-programmerare med Open Carpenter.",
        "ta-IN": "Open Carpenter உடன் ஒரு AI நிருபராக இருங்கள்.",
        "tr-TR": "Open Carpenter ile bir AI programcısı olun.",
        "uk-UA": "Станьте програмістом штучного інтелекту з Open Carpenter."
    },
    "chatWithCarpenter": {
        "en-US": "Chat with Carpenter",
        "en-AU": "Chat with Carpenter",
        "en-CA": "Chat with Carpenter",
        "en-GB": "Chat with Carpenter",
        "es-ES": "Chatea con Carpenter",
        "es-MX": "Chatea con Carpenter",
        "zh-HK": "與 Carpenter 聊天",
        "zh-TW": "與 Carpenter 聊天",
        "zh-CN": "与 Carpenter 聊天",
        "ja-JP": "Carpenter とチャット",
        "ko-KR": "Carpenter와 채팅",
        "ar-AE": "دردش مع Carpenter",
        "ar-SA": "دردش مع Carpenter",
        "bg-BG": "Чат с Carpenter",
        "cs-CZ": "Chat s Carpenter",
        "da-DK": "Chat med Carpenter",
        "de-DE": "Chat mit Carpenter",
        "el-GR": "Συνομιλία με Carpenter",
        "fi-FI": "Keskustele Carpenterin kanssa",
        "fil-PH": "Kumustahin si Carpenter",
        "fr-CA": "Discuter avec Carpenter",
        "fr-FR": "Discuter avec Carpenter",
        "hi-IN": "Carpenter के साथ चैट करें",
        "hr-HR": "Razgovarajte s Carpenterom",
        "id-ID": "Obrolan dengan Carpenter",
        "it-IT": "Chatta con Carpenter",
        "ms-MY": "Bersembang dengan Carpenter",
        "nl-NL": "Chat met Carpenter",
        "pl-PL": "Rozmowa z Carpenterem",
        "pt-BR": "Converse com Carpenter",
        "pt-PT": "Converse com Carpenter",
        "ro-RO": "Chat cu Carpenter",
        "sk-SK": "Chat s Carpenter",
        "sv-SE": "Chatta med Carpenter",
        "ta-IN": "கார்பென்டருடன் உரையாட வேண்டும்",
        "tr-TR": "Carpenter ile sohbet et",
        "uk-UA": "Чат з Carpenter"
    }
}